{
    
    "data":[
        {
            "name":"Action Mimicry",
            "tags":["beneficial","mental"],
            "flavor":"Uplifted monkey see, uplifted monkey do.",
            "ranks":[
                "Hero always gains [+] to tests when copying an action they have seen successfully performed (e.g., after seeing somebody climb the wall of the Red Tower, they gain [+] on their test).",
                "Hero can repeat their actions flawlessly. If they have already succeeded at a task, they can duplicate it precisely (unless circumstances change).",
                "Hero gains [+] to copying other creatures' behaviours and mannerisms."
            ]
        },
        {
            "name":"Agility of the Arbitrary Autarch",
            "tags":["beneficial","physical"],
            "flavor":"As daemons follow no earth-bound command, neither should we.",
            "ranks":[
                "+1 agility and maximum agility increased to 6.",
                "+1 agility, max to 7.",
                "+2 agility or hero gains an additional action."
            ]
        },
        {
            "name":"Another Mind",
            "tags":["deleterious","mental","physical","chimerism"],
            "flavor":"The seed of truth grows within.",
            "ranks":[
                {
                    "base":"Hard, cyst-like nodule develops on the ",
                    "entries":[
                        "throat",
                        "stomach",
                        "lumbar spine",
                        "upper back"
                    ],
                    "end":"."
                },
                "The nodule grows larger and bonier, a secondary brain begins to develop within. Reflexes are accelerated while the hero becomes vulnerable to critical hits. Clothes no longer fit.",
                "The secondary brain grows larger and faster. The hero’s perception and analytical abilities increase. The disfigurement is more pronounced. ",
                {
                    "base":"The secondary brain achieves a semblance of independent thought and develops unusual mental abilities, such as ",
                    "entries":[
                        "pyrokinesis",
                        "telekinesis",
                        "electrokinesis",
                        "tele-empathetic manipulation"
                    ],
                    "end":". Sometimes it takes over the hero’s body."
                }
            ]
        },
        {
            "name":"Astral Eyes",
            "tags":["deleterious","mental","cosmic"],
            "flavor":"The world you is a veil hiding the deeper beauty of the fields of ka.",
            "ranks":[
                {
                    "base":"Eyes turn ",
                    "entries":[
                        "milky",
                        "pitch black",
                        "translucent",
                        "like amber orbs"
                    ],
                    "end":"Vision is impaired."
                },
                "Eyes evaporate out of their sockets. Hero is blind.",
                "A heavy, misty gas leaks out of the hero’s sockets. They perceive auras with new organs growing where their eyes once rolled in fear and terror.",
                "Faceted crystalline growths spread to the edges of the empty sockets, like queer jewellery. Hero can directly perceive the ka of living creatures."
            ]
        },
        {
            "name":"Avatar Infection",
            "tags":["beneficial","physical","cosmic"],
            "flavor":"They have been chosen by fate to bear witness to creation.",
            "ranks":[
                "When the hero’s body is killed or otherwise shut down, it secretes an ichor cocoon and reassembles at a rate of 1 life per day. Reassembly is complete when the hero is at full life. Each reassembly reduces endurance by 1. This may accidentally duplicate the hero if their ka-ba was otherwise engaged or preserved at the time.",
                "When the hero’s body is killed or otherwise shut down, the hero’s ka-ba is instantly translated into a nearby phylactery-analogue (a stone, nut, or jewel). Over a few minutes, it exudes an ectoplasmic body, which recomposes into the hero at a rate of 1 life per day. As an ectoplasmic body, the hero may barely interact with the physical world. Recomposition completes at full life. Each recomposition reduces endurance by 1.",
                "When the hero’s body is killed or shut down, it immediately breaks down into a luminous body radiating peace and freedom. Over a few days, it  solidifies into a physical body. Each solidification increases one stat by 1 and reduces another stat by 1. It imposes an additional ‘burden of witnessing’ on the hero. This burden cannot be removed normally. After bearing seven such burdens, the hero is jaded and has no further desire to adventure."
            ]
        },
        {
            "name":"Blue God’s Sign",
            "tags":["deleterious","physical","corruption"],
            "flavor":"From rot comes purification.",
            "ranks":[
                "The filth of chaos oozes from the hero’s pores. They become resilient to disease, but the smell is pestilential.",
                "Fresh orifices open up on the skin and ooze a blood-like serum. Wounds do not fully heal and release a similar fluid.",
                "Skin becomes a cratered, heaving, suppurating mess covered in wriggling symbiotes that resemble grave worms. Nose, ears, eyelids, and other thin cutaneous areas may rot away.",
                "A whiteish substance with the consistency of clotted yoghurt continually drips from the symbiotes. This milk of the Blue God has strong analgesic and numbing properties. The hero becomes entirely resistant to diseases and poisons."
            ]
        },
        {
            "name":"Cosmic Channeling",
            "tags":["beneficial","mental","cosmic"],
            "flavor":"All magic. From the same void.",
            "ranks":[
                "When the hero sees a spell cast, they may make a moderate aura test to see if they grab an echo of the spell in their ego-matrix (inventory). They can cast each echo once. The spell price must still be paid.",
                "Spell echo prices are halved.",
                "It is now an easy test to capture spell echoes."
            ]
        },
        {
            "name":"Deep Skill Augmentation",
            "tags":["beneficial","physical","technological"],
            "flavor":"A protein machine ghost infects the hero’s brain, feeding them memories and skills from someone long dead.",
            "ranks":[
                "Hero gains [+] to all tests with one of their skills.",
                "Hero gains [+] with a second skill. One mental stat increases by 1, another stat decreases by 1.",
                "Rewiring is completed. The hero becomes tetrachromatic, seeing a wider spectrum of colours. They gain +1 charisma. The ghost of a dead personality becomes a lodger in their brain."
            ]
        },
        {
            "name":"Eater’s Curse",
            "tags":["deleterious","physical","corruption"],
            "flavor":"Its hunger shall consume the cosmos.",
            "ranks":[
                "Teeth fall out. Chewing is difficult.",
                "Needle-sharp fangs, translucent like those of a deep-sea fish, grow profusely from the softened gums. Chewing is impossible.",
                "Fangs turn hard and black, mouth grows unnaturally wide, jaw develops hinges. Hero gains a bite attack (1d4).",
                "Entire head unfolds into biting maw. Bite attack (1d8)."
            ]
        },
        {
            "name":"Endurance of Ecstasy",
            "tags":["beneficial","physical"],
            "flavor":"Through the joy of existence shared, all sufferings are easier.",
            "ranks":[
                "+1 endurance and maximum endurance increased to 6. ",
                "+1 endurance, max to 7.",
                "+2 endurance or hero gains two bonus slots for burdens."
            ]
        },
        {
            "name":"Existential Dysfunction",
            "tags":["deleterious","spiritual","cosmic"],
            "flavor":"Beyond reality, other ways.",
            "ranks":[
                "A barely perceptible darkness cloaks the hero, like diaphanous wreaths of pure nothingness. They become sensitive to bright lights.",
                "The dark between stars now obviously wreathes the hero. They walk in shadow even on the brightest of days. Bright radiation or sanctified memory waters cause physical pain.",
                "The void seeps into the hero, making them colourless and darkly-shaded. Smoke curls within their eyes and even in darkest night a faint ur-hue lets them find their way.",
                "The hero is no longer quite there, appearing as somehow translucent and absent. They have a harder time interacting with the physical world and carrying heavy loads. At the same time, the world also has a harder time affecting them. "
            ]
        },
        {
            "name":"Extraordinary Precognition",
            "tags":["beneficial","mental"],
            "flavor":"Feel the pain of the future.",
            "ranks":[
                "Hero can glimpse the future. It hurts. Spend 1 life to gain [+] on any test to avoid damage.",
                "Subconscious packing. The hero can bundle up an undefined item no larger than one stone. At an opportune moment, it turns out to be mundane but useful.",
                "Dooms were always written. When disaster befalls the hero and their companions, the hero can spend 7 life and one prized possession. All along, they were not there. They had even warned their companions, but they chose not to listen. The hero makes their escape, aware that there was truly nothing they could do to save anybody but themselves. "
            ]
        },
        {
            "name":"Fingers of the Other Side",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"Reality will conform to revelation.",
            "ranks":[
                {
                    "base":"Vestigial fingers or toes protrude from the flesh on the hero’s ",
                    "entries":[
                        "flanks",
                        "arms",
                        "legs",
                        "back"
                    ],
                    "end":"."
                },
                "The digits elongate and become as strong as those on the hero’s hands.",
                "The digits grow even longer, more powerful, with more joints, like a cross between fingers and sinewy spider legs.",
                "The digits are so many and so powerful they can unfold like a fan and easily trap or catch anything trying to pass by."
            ]
        },
        {
            "name":"The Fur Feral",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"The wild will break free.",
            "ranks":[
                "The body grows heavy, beset by chronic fatigue. Hairs become thorn-like, nails thicken and curl.",
                "Follicles grow oversized, and masses of keratinous fibres replace normal hair, covering the body in a spongy layer. Movement becomes clumsy, but blows are cushioned (+1 ha defence).",
                "Prolific, heavy ropes of keratin grow from the body constantly (1 stone’s worth per day). Appetite increases. Unless the ropes are cut regularly, they quickly overwhelm the hero’s ability to move.",
                {
                    "base":"The keratin growth diversifies, covering the unrecognizable hero in swift-growing ",
                    "entries":[
                        "shiny scales",
                        "sharp spines",
                        "thick fur",
                        "luxurious feathers"
                    ],
                    "end":"."
                }
            ]
        },
        {
            "name":"Hostile Heaven’s Armour",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"In the heavens, there is only war.",

            "ranks":[
                "Strange bones erupt from the skin. Clothes fit ill.",
                "Bones grow into jutting spikes, blades, and ridges. Wearing armour becomes next to impossible. Attackers may be injured (1d4 damage).",
                "Elaborate spines, hooks, and plates cover the hero, defending them from attack (+2 ha defence) and increasing their threat (1d6 natural damage).",
                "The bony structures develop into a terrifying suit of biological armour (+5 ha defence)."
            ]
        },
        {
            "name":"Idle One’s Claws",
            "tags":["deleterious","physical","corruption"],
            "flavor":"The predator does not work, it takes.",
            "ranks":[
                "Random hand withers and weakens. Using tools with that hand becomes difficult.",
                "Hand locks into a deformed claw. Using tools is impossible.",
                "Bones and gristle flow and reform into a trefoil ripping, cutting claw array. Hero gains an unarmed attack (1d6).",
                {
                    "base":"The claws bleed void stuff into this near world. The merest scratch from them causes ",
                    "entries":[
                        "paralysis",
                        "acute formication",
                        "hyperalgesia",
                        "muscle spasms"
                    ],
                    "end":"."
                }
            ]
        },
        {
            "name":"Ineffable Patterns of Being",
            "tags":["deleterious","mental","cosmic"],
            "flavor":"ERROR. Reality compile fail. There is no abort, there is only retry.",
            "ranks":[
                "Intelligence is reduced. Hero’s twitching mind cannot avoid alien things lurking in the corners of reality.",
                "Personality becomes alien. Hero no longer feels some human emotions while acquiring other stranger ones.",
                "Mind becomes temporally scattered. Hero gains mild precognition, avoiding immediate threats with unnatural speed and precision. At the same time, they can no longer focus on the here and now.",
                {
                    "base":"Hero’s ba or personality is smeared out completely, replaced by something alien. Hero becomes immune to all mental attacks and acquires an ineffable goal, perhaps to ",
                    "entries":[
                        "create odd patterns at energy interstices",
                        "collect words and memories from key individuals",
                        "paint alien murals on symbolic objects",
                        "sing chants in the ruins of elder time"
                    ],
                    "end":"."
                }
            ]
        },
        {
            "name":"Lifebound Gift",
            "tags":["beneficial","physical","cosmic"],
            "flavor":"The hero’s being is bound more tightly to the given world. Their life force burns brighter.",
            "ranks":[
                "Hero gains +1 life for every current and future level.",
                "+1 more life per level.",
                "Hero gains a second, mystical heart, which holds 2 life for every current and future level. The hero can only use these life points to pay spell prices or as gifts to other living creatures."
            ]
        },
        {
            "name":"Magic Mule",
            "tags":["beneficial","physical"],
            "flavor":"Such broad shoulders, such strong back.",
            "ranks":[
                "The hero can carry twice as much as a normal human: two sacks without encumbrance, plus one cumbersome sack total. The additional sack can only hold physical objects.",
                "The hero can carry two additional cumbersome sacks.",
                "The hero can carry five additional cumbersome sacks for a total of ten. That’s about a ton."
            ]
        },
        {
            "name":"Metabolic Hyperdrive",
            "tags":["beneficial","physical"],
            "flavor":"The difference under the skin.",
            "ranks":[
                "The hero derives sustenance from anything organic, and their stomach is immune to organic poisons. Unfortunately, alcohol barely works on them anymore.",
                "Hero can slow down or accelerate their metabolism, either hibernating without food for months or spending 1 life to gain an additional action.",
                "Abmortality engines in the hero’s body keep their genetic source code in perfect condition and breakdown all toxins and drugs that might interfere with their functioning. The hero can also shutdown, going into a week-long debugging mode, which purges all harmful viruses and organisms from their body."
            ]
        },
        {
            "name":"A New Face",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"Hypocrisy stripped reveals a new visage.",
            "ranks":[
                {
                    "base":"An additional eye and teeth develop on the ",
                    "entries":[
                        "hand or arm",
                        "leg or foot",
                        "back or shoulder",
                        "chest or groin"
                    ],
                    "end":". They are non-functional. If removed, they grow back."
                },
                "The eye becomes functional. Additional buds form. Cartilage and gums form around the teeth.",
                "A second eye joins the first. Nose-bud forms. A functional mouth forms around the teeth. The hero can ingest sustenance and speak with the second mouth.",
                {
                    "base":"A complete face forms. Its distorted features can part to reveal a ",
                    "entries":[
                        "venomous bite",
                        "fearsome gaze",
                        "blood-sucking fangs",
                        "voice like an angelic choir"
                    ],
                    "end":"."
                }
            ]
        },
        {
            "name":"Oldtech Immunity Ghost",
            "tags":["beneficial","physical","technological"],
            "flavor":"The hero gains a semi-sentient distributed immune system.",
            "ranks":[
                "[+] to all tests against diseases, poisons, radiations, or other environmental effects.",
                "Their resistance turns to complete immunity, and they gain resistance to a second effect.",
                "Their second resistance also becomes immunity, and their immune system becomes a fully sentient hive-symbiote (L3, caustic) that communicates via direct brain link. The symbiote can perform molecular-level analyses of substances. It also has an acerbic sense of humour. "
            ]
        },
        {
            "name":"Optidrone Upgrade",
            "tags":["beneficial","physical","technological"],
            "flavor":"Eyes like the star gods.",
            "ranks":[
                "Hero’s eyes become as sharp as those of a hawk.",
                "Hero’s eyes gain the ability to see into the ultraviolet and infrared spectra.",
                "Hero gains the ability to remove their eyes and use them as remote drones. Each eye can survive for up to a day outside of its socket. It costs the hero 1 life and 1 hour to grow a new eye. They can grow as many eyes at a time as they have sockets."
            ]
        },
        {
            "name":"Plastic Bone Structures",
            "tags":["beneficial","physical","technological"],
            "flavor":"Flexibility at all costs.",
            "ranks":[
                "The hero can slowly adjust their bones’ shape and size, squeezing through small spaces, growing taller or shorter, or mimicking other people’s faces.",
                "The hero’s bones heal and set in hours. They might expand their bones into a crash cage, launch off a cliff, then reknit themselves. This would hurt.",
                "The hero adjusts their bones  so swiftly that they gain [+] in physical conflict when relevant."
            ]
        },
        {
            "name":"Playset Corpus",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"The body is a delicate playground.",
            "ranks":[
                "The hero’s joints become grotesquely hypermobile. Movement is slow and deliberate.",
                "Limbs strangely flexible. Additional joints appear. Though more agile, the hero is weaker. Clothes fit awkwardly. They can rotate their head like an owl.",
                "Shoulder girdle and hips can rotate freely, each vertebra can dislocate, each rib can waggle.",
                "Hero can rearrange their bone structure almost at will. Bones travel within their flesh, creating alien forms reminiscent of the vatula-vyakula of the Restless Second Creation."
            ]
        },
        {
            "name":"Predatory Assimilator",
            "tags":["beneficial","physical"],
            "flavor":"Almost a ghoul.",
            "ranks":[
                "The hero heals by eating biomatter close to their basic body pattern. Recover 1 life for every stone of flesh consumed (an adult humanoid averages 10 stone). For humans: chimps and lemurs are good, pigs less so. In a healing-frenzy, they can ingest a stone of flesh per action.",
                "Recover 2 life for every stone or 1 stat for 5 stones.",
                "Recover 4 life for every stone or 1 stat for 2 stones. Remove 1 burden by consuming 10 stones and vomiting them out again (this does not restore life or stats)."
            ]
        },
        {
            "name":"Protean Infinity",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"Fixity of form was a mistake.",
            "ranks":[
                "Bones become brittle and prone to breaking. Hero becomes more vulnerable to physical damage.",
                "Bones soften, while fluid organs develop and strengthen to provide stability.",
                "Bones dissolve entirely. Only sinew and cartilage support the now alien musculature. Staying vaguely bipedal is an effort. The face collapses and smears. Enclosing armour helps with mobility.",
                "Hero becomes a protean thing of strange organelles and fluid body plan."
            ]
        },
        {
            "name":"Psionic Eruption",
            "tags":["beneficial","mental"],
            "flavor":"Inhuman mental abilities. Fear awakens in baseliners’ hearts.",
            "ranks":[
                "Hero acquires a spell. When using this spell, their magic cost is always 1.",
                "Gains 2nd spell.",
                "Hero gains +2 ka defence."
            ]
        },
        {
            "name":"Radiation’s Skin",
            "tags":["deleterious","physical","corruption"],
            "flavor":"The fires of the celestial truths were not made to reside within the skin of man.",

            "ranks":[
                "Skin becomes flaky, pale, and colourless. It is usually cold to the touch.",
                "Suppurating boils weep around the edges of chitinous growths. Hero gains natural leathery armour (+1 ha defence).",
                "Skin continually rots and sloughs off in translucent, malodorous sheets. Escape bonds and restrictions more easily.",
                "Skin is entirely replaced with a ghostly radiant aura that leaves faint burns and bruises on organic materials. The aura-skin gives off a greenish light, strong enough to read by if one squints."
            ]
        },
        {
            "name":"Secret Weapon",
            "tags":["beneficial","physical","technological"],
            "flavor":"They were the weapon all along.",
            "ranks":[
                {
                    "base":"",
                    "entries":[
                        "Claws are hidden in the hero’s fingers (1d4).",
                        "Blades are hidden in the hero's arms (1d6).",
                        "Hero has venomous fangs (1d3, poison).",
                        "Hero has blades in their feet (1d6).",
                        "God blaster in the belly (3d6).",
                        "Third set of barbed, void-hooked limbs in shoulder blades (1d8)."
                    ],
                    "end":""
                },
                "Damage increased 1 step.",
                "Damage increased 1 more step and +1 ha defence."
            ]
        },
        {
            "name":"Sky-Brought Curse",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"They sailed on wings among the galaxies.",
            "ranks":[
                "Vestigial wings or flagellae bulge and flail on the hero’s back.",
                "The primitive wings erupt in a tangle of membranes, struts, and tines. The hero can slow their fall or boost their jump. ",
                "The wings look like nothing this-worldly, but they let the hero glide convincingly. The hero’s entire body structure adapts to support the odd structures. Falls no longer kill.",
                "The massive powered wings drain bone and gristle and flesh from the rest of the hero, leaving them stick-thin but capable of flight."
            ]
        },
        {
            "name":"Song Wormed",
            "tags":["deleterious","mental","cosmic"],
            "flavor":"There are songs in the lines of creation.",
            "ranks":[
                "Ears wither away to nubs. Hearing is impaired.",
                {
                    "base":"Strange organs spread across the hero’s head from the ruined nubs of their ears. Hearing is very impaired. Hero gains the ability to detect ",
                    "entries":[
                        "magnetic fields",
                        "electric currents",
                        "radio waves",
                        "magitechnic emanations"
                    ],
                    "end":"."
                },
                "Lacy, antennae-like horns erupt from the hero’s head, letting them understand the strange radiations they could previously only detect."
            ]
        },
        {
            "name":"Sign of the Third Hand",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"New hands reach new truths.",
            "ranks":[
                {
                    "base":"A vestigial ",
                    "entries":[
                        "tail",
                        "arm",
                        "tentacle",
                        "arthropod limb grows on the body"
                    ],
                    "end":". It dangles uselessly. If cut off, it grows back."
                },
                "Limb grows stronger. Capable of picking up light objects. Clothes no longer fit.",
                "The new appendage grows larger and stronger than the original limbs. The whole hero can lift themselves by their third ‘arm’. Additional vestigial limb buds form.",
                "Another appendage, just as powerful, bursts forth. Limb buds stud the body."
            ]
        },
        {
            "name":"Strength of the Solitary Sun",
            "tags":["beneficial","physical"],
            "flavor":"As though powered by the nuclear furnaces of the cosmos itself.",
            "ranks":[
                "+1 strength and maximum strength increased to 6.",
                "+1 strength, max to 7.",
                "+2 strength or max to 9."
            ]
        },
        {
            "name":"Thoughtful as Thoth Trueseer",
            "tags":["beneficial","mental"],
            "flavor":"With progressive insight, human constraints and fears fade away.",
            "ranks":[
                "+1 thought and maximum thought increased to 6.",
                "+1 thought, max to 7.",
                "+2 thought or hero becomes immune to enchantments and other mind-control technologies."
            ]
        },
        {
            "name":"Transhuman Reflexes",
            "tags":["beneficial","physical","technological"],
            "flavor":"Neural rewiring and fast-twitch nodes lifted from the dark sky supersoldier programs.",
            "ranks":[
                "Hero gains [+] on initiative tests and always gets one (more) action during any surprise round.",
                "[+] whenever hero tests to dodge or otherwise avoid incoming danger.",
                "Hero gains an additional action or mild precognition (+2 to all defences)."
            ]
        },
        {
            "name":"Ultimate Chimerism ",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"No beast shall dominate another beast in the chimerical time.",
                
            "ranks":[
                "Feet become deformed and oddly turned. Walking is impaired.",
                "Legs change form and angle, becoming bestial. Wearing shoes becomes impossible.",
                {
                    "base":"Legs and feet clearly resemble ",
                    "entries":[
                        "the hoofed limbs of an ungulate",
                        "the paws of a predator",
                        "the talon-tipped feet of a bird",
                        "nothing so much as the many-jointed limbs of an endoskeletal insect"
                    ],
                    "end":"."
                },
                "The hero pupates, and in a grotesque transformation, their abdomen, hips, and lower limbs are duplicated. With four legs, their movement is faster or more sure, but they are less manoeuvrable. Chairs and tight spaces become uncomfortable."
            ]
        },
        {
            "name":"Waking Bones’ Lament",
            "tags":["deleterious","physical","corruption"],
            "flavor":"There is no life eternal but death.",
            "ranks":[
                "Hero becomes bony and raw. Skin is like parchment, digestion slows and weakens.",
                "Only sinew and gristle remain beneath paper skin. Joints click and rattle. The skeletal hero can only digest blended soups.",
                "The hero’s organs atrophy, leaving a mummified undead abomination. They can only digest raw blood purée.",
                {
                    "base":"The hero’s bones absorb their flesh, leaving a sparkling skeleton that looks like ",
                    "entries":[
                        "jade",
                        "bronze",
                        "ebony",
                        "porcelain"
                    ],
                    "end":"They no longer eat, directly leeching nearby creatures' life force to stay alive instead "
                }
            ]
        },
        {
            "name":"Waterdrinker’s Raiment",
            "tags":["deleterious","physical","chimerism"],
            "flavor":"From void sea come, to void sea return.",
            "ranks":[
                "Vestigial gills and cutaneous gas bladders form on the neck and abdomen of the hero. They can hold their breath quite a bit longer than before.",
                "An array of functional gills and gas-exchange organs turns the hero into an amphibian.",
                "Webbing increases the hero’s swimming speed.",
                "Glowing biochemical factories pockmark the body and let them breathe strange gases and liquids."
            ]
        }
    ]
}