{
  "actionmimicry": {
    "name": "Action Mimicry",
    "tags": ["mutation", "ka"],
    "flavor": "Uplifted monkey see, uplifted monkey do.",
    "ranks": [
      "Hero always gains [+] to tests when copying an action they have seen successfully performed (e.g., after seeing somebody climb the wall of the Red Tower, they gain [+] on their test).",
      "Hero can repeat their actions flawlessly. If they have already succeeded at a task, they can duplicate it precisely (unless circumstances change).",
      "Hero gains [+] to copying other creatures' behaviours and mannerisms."]},
  "aestheticcreation": {
    "name": "Aesthetic Creation",
    "tags": ["trait", "ba", "technological"],
    "flavor": "Made in Beautiful.",
    "ranks": [
      "Hero chooses a cosmetic mutation. Gains 1 charisma.",
      "Hero gains 1 charisma and increases ba damage 1 step.",
      "Hero chooses a cosmetic mutation and gains 1 ba defence."]},
  "agilityofthearbitraryautarch": {
    "name": "Agility of the Arbitrary Autarch",
    "tags": ["mutation", "ha"],
    "flavor": "As daemons follow no earth-bound command, neither should we.",
    "ranks": [
      "+1 agility and maximum agility increased to 6.",
      "+1 agility, max to 7.",
      "+2 agility or hero gains an additional action."]},
  "alwaysready": {
    "name": "Always Ready",
    "tags": ["voyager","trait"],
    "flavor": "The first few seconds after entering the portal are the most critical.",
    "ranks": [
      "[+] to initiative rolls. 2-in-6 chance to not be surprised.",
      "Gains an extra action in the first round of a combat.",
      "Gains [+] to all rolls in the first round of a combat."]},
  "anothermind": {
    "name": "Another Mind",
    "tags": ["mutation", "ka", "chimerism"],
    "flavor": "The seed of truth grows within.",
    "ranks": [
      {
        "base": "Hard, cyst-like nodule develops on the ",
        "entries": ["throat", "stomach", "lumbar spine", "upper back"],
        "end": "."
      },
      "The nodule grows larger and bonier, a secondary brain begins to develop within. Reflexes are accelerated while the hero becomes vulnerable to critical hits. Clothes no longer fit.",
      "The secondary brain grows larger and faster. The hero’s perception and analytical abilities increase. The disfigurement is more pronounced. ",
      {
        "base": "The secondary brain achieves a semblance of independent thought and develops unusual mental abilities, such as ",
        "entries": [
          "pyrokinesis",
          "telekinesis",
          "electrokinesis",
          "tele-empathetic manipulation"
        ],
        "end": ". Sometimes it takes over the hero’s body."
      }
    ]
  },
  "arcanophagesymbiosis": {
    "name": "Arcanophage Symbiosis",
    "tags": ["mutation", "ka", "magical", "voyager"],
    "flavor": "Developed a symbiotic relationship with a colony of magic-devouring bacteria.",
    "ranks": [
      "Magic Cost increased by 1. Heal life when targeted by a spell. Heal amount equals base casting cost.",
      "Magic Cost further increased by 1. Can spend 10 minutes to absorb the magical properties from an object, healing 1d6 per property.",
      "Magic Cost of all creatures in the vicinity increased by 1. Heal life when a spell is cast nearby."]},
  "artfuldodger": {
    "name": "Artful Dodger",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Important for staying alive.",
    "ranks": [
      "Hero gains [+] to tests to avoid area effects, explosions, nasty spills, and other similar problems. Gains 1 ha defence.",
      "Teflon reputation. Resistant to all kind of splash damage. [+] to tests to avoid legal repercussions.",
      "Experience in staying ahead. Adds highest mental stat to ha defence and highest physical stat to ba defence."]},
  "artiforganism": {
    "name": "Artiforganism",
    "tags": ["trait", "ha", "technological"],
    "flavor": "The unborn. The made.",
    "ranks": [
      "Hero is not actually alive. Does not need to eat, breathe, drink, or sleep. Gains energy from the sun or from magical batteries.",
      "Hero can replicate themselves given a few weeks and security backups.",
      "Upgradeable. Hero gains 4 inventory slots for mutations and other enhancements."]},
  "astraleyes": {
    "name": "Astral Eyes",
    "tags": ["mutation", "ka", "cosmic"],
    "flavor": "The world you is a veil hiding the deeper beauty of the fields of ka.",
    "ranks": [
      {
        "base": "Eyes turn ",
        "entries": ["milky", "pitch black", "translucent", "like amber orbs"],
        "end": ". Vision is impaired."
      },
      "Eyes evaporate out of their sockets. Hero is blind.",
      "A heavy, misty gas leaks out of the hero’s sockets. They perceive auras with new organs growing where their eyes once rolled in fear and terror.",
      "Faceted crystalline growths spread to the edges of the empty sockets, like queer jewellery. Hero can directly perceive the ka of living creatures."]},
  "auralcorona": {
    "name": "Aural Corona",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "Flaring off the elemental excess.",
    "description": "Hero is surrounded by ",
    "table": [
      "Light",
      "Fire",
      "Sky ",
      "Water",
      "Green",
      "Metal",
      "Radiation",
      "Void"
    ],
    "ranks": [
      "Hero crackles with an overcharged aura. They take half damage from their element.",
      "Hero can spend 1 life to flare their aura to an adjacent creature, either sharing their resistance or transferring all the damage they avoided.",
      "Hero takes minimum damage from their element."]},
  "avatarinfection": {
    "name": "Avatar Infection",
    "tags": ["mutation", "ha", "cosmic"],
    "flavor": "They have been chosen by fate to bear witness to creation.",
    "ranks": [
      "When the hero’s body is killed or otherwise shut down, it secretes an ichor cocoon and reassembles at a rate of 1 life per day. Reassembly is complete when the hero is at full life. Each reassembly reduces endurance by 1. This may accidentally duplicate the hero if their ka-ba was otherwise engaged or preserved at the time.",
      "When the hero’s body is killed or otherwise shut down, the hero’s ka-ba is instantly translated into a nearby phylactery-analogue (a stone, nut, or jewel). Over a few minutes, it exudes an ectoplasmic body, which recomposes into the hero at a rate of 1 life per day. As an ectoplasmic body, the hero may barely interact with the physical world. Recomposition completes at full life. Each recomposition reduces endurance by 1.",
      "When the hero’s body is killed or shut down, it immediately breaks down into a luminous body radiating peace and freedom. Over a few days, it  solidifies into a physical body. Each solidification increases one stat by 1 and reduces another stat by 1. It imposes an additional ‘burden of witnessing’ on the hero. This burden cannot be removed normally. After bearing seven such burdens, the hero is jaded and has no further desire to adventure."]},
  "beneficiaryofchoice": {
    "name": "Beneficiary of Choice",
    "tags": ["trait", "ba", "social"],
    "flavor": "Some give, they receive.",
    "description": "Hero’s mysterious sponsors say they represent the ",
    "table": [
      "Archaic Independence Front",
      "Council Metropolitan",
      "De Werker Aristocracie",
      "God Factory",
      "Nu-Vome Consortium",
      "Solar Gateway Initiative",
      "Wine Vampire Endowment",
      "Zu Kompleks DeityTM"
    ],
    "ranks": [
      "Hero gains 1 charisma (maximum +6). Once per week, they can receive a mysterious package, no larger than a small coffin, containing a non-magical machine or item of their choice.",
      "Hero gains 1 ba defence. Once per day, hero receives guidance via a deep implant. Either [+] on their next test or a true answer (the player may simply narrate something they “know”, subject to the referee’s soft veto).",
      "When a hero would die, they instead find themselves awake and unable to move in a strange coccoon, with shadowy shapes talking about “preparing the backup”. Next thing they know, they’re back in their bed missing some memories (hero permanently loses 1 skill)."]},
  "bloodclad": {
    "name": "Bloodclad",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Action hero style.",
    "ranks": [
      "When below half life, hero only takes half physical damage. They’re tougher covered in their own shiny blood!",
      "Below half life, hero can shrug off one ha attack per round.",
      "At 0 life, hero can shrug off one more ha attack per round."]},
  "bloodynimble": {
    "name": "Bloody Nimble ",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Speed overwhelming.",
    "ranks": [
      "Once per turn hero can spend 1 life to gain one additional action. This boost is not an action.",
      "Hero can choose to spend 3 life to gain two actions instead.",
      "If the hero suffers any damage, they gain [+] to initiative and agility tests for one round."]},
  "bluegodssign": {
    "name": "Blue God’s Sign",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "From rot comes purification.",
    "ranks": [
      "The filth of chaos oozes from the hero’s pores. They become resilient to disease, but the smell is pestilential.",
      "Fresh orifices open up on the skin and ooze a blood-like serum. Wounds do not fully heal and release a similar fluid.",
      "Skin becomes a cratered, heaving, suppurating mess covered in wriggling symbiotes that resemble grave worms. Nose, ears, eyelids, and other thin cutaneous areas may rot away.",
      "A whiteish substance with the consistency of clotted yoghurt continually drips from the symbiotes. This milk of the Blue God has strong analgesic and numbing properties. The hero becomes entirely resistant to diseases and poisons."]},
  "bodymagic": {
    "name": "Body Magic",
    "tags": ["trait", "ha", "technological"],
    "flavor": "There is no mind but flesh.",
    "ranks": [
      "Hero can choose to use their strength or endurance stat when casting spells or making magical tests.",
      "Additionally, can add strength or endurance to dice rolled when casting spells or during ka conflicts.",
      "Increase strength or endurance by 1. May use their strength or endurance stat for ka defences."]},
  "bornsurvivor": {
    "name": "Born Survivor",
    "tags": ["voyager","trait"],
    "flavor": "",
    "ranks": [
      "If hero would be reduced to 0 life, instead they may spend a hero die and be reduced to 1 life instead.",
      "[+] to death saves.",
      "When the hero would die or become permanently lost, they miraculously appear at the end of the session on the brink of death, then remove this trait."]},
  "bravelyrunsaway": {
    "name": "Bravely Runs Away",
    "tags": ["trait", "ba", "combat"],
    "flavor": "Can’t touch this.",
    "ranks": [
      "Opponents suffer [-] when hero is retreating. Any sacrifices to avoid encounters are worth twice as much.",
      "[+] to all tests while being chased. Ally morale does not suffer when hero retreats.",
      "Cowardly reputation. [+] to surprise attacks and against fear effects. Takes half damage from social attacks."]},
  "breaktheweak": {
    "name": "Break the Weak",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Cut them down like wheat.",
    "ranks": [
      "When hero physically strikes an opponent of lower level than themselves, the opponent is out of the fight (and probably dead).",
      "When the hero knocks an opponent out of the fight, they get a free attack against a nearby target.",
      "Hero gains 1d4 life every time they strike a lower level opponent."]},
  "channelinghands": {
    "name": "Channeling Hands",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "Be the conduit.",
    "description": "Hero conducts the element of ",
    "table": [
      "Light",
      "Fire",
      "Sky ",
      "Water",
      "Green",
      "Metal",
      "Radiation",
      "Void"
    ],
    "ranks": [
      "Hero’s bare hands can flare with the element. They can’t throw it, but they can affect matter. Also, their unarmed attacks deal elemental damage damage.",
      "Elemental conduit grows. Unarmed elemental damage increases two steps (e.g. 1d3 to 1d6).",
      "Conduit grows. Damage increases two more steps (e.g. 1d6 to 1d12)."]},
  "choiceconsumer": {
    "name": "Choice Consumer",
    "tags": ["voyager","trait"],
    "flavor": "",
    "ranks": [
      "When you use a consumable or supply, there is a 1-in-6 chance it's not consumed.",
      "2-in-6 chance. [+] to tests when using a consumable.",
      "3-in-6 chance. Consumable effects are doubled."]},
  "chromaticavatar": {
    "name": "Chromatic Avatar",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "There is power in this hue.",
    "description": "Hero is chosen by the colour ",
    "table": ["Purple", "Blue", "Green", "Yellow", "Orange", "Red"],
    "ranks": [
      "The hero is vividly coloured. They have [+] to tests against targets of their own hue, for the little differences are the worst differences.",
      "They are resistant to damage from objects of their own hue and gain [+] to effects with tools of their own hue.",
      "With one hand they can drain other hues from objects, with the other they can impart their own hue to objects. This is about as fast and effective as regular hand painting, so changing the colour of a large object will take quite a while."]},
  "citoyenformidable": {
    "name": "Citoyen Formidable",
    "tags": ["trait", "ba", "social"],
    "flavor": "The city makes the citizen.",
    "ranks": [
      "The natural city-slicker. Hero gains [+] to social interactions, travel, and navigation in cities.",
      "Social and physical attacks against the streetwise hero suffer [-] in cities.",
      "Hero deals damage with [+] in cities. The environment is full of improvised weapons."]},
  "combatmonster": {
    "name": "Combat Monster",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Fight alone. Fight dirty.",
    "ranks": [
      "When the hero fights alone, they have [+] to attacks and tests to trip, trick, or otherwise hinder their enemy. But they never benefit from flanking or other help in combat.",
      "When the hero fights alone, their opponents never gain [+] from flanking or outnumbering the hero.",
      "When the hero fights an equal or higher level opponent alone, they gain [+] to damage and damage dice explode."]},
  "cosmicchanneling": {
    "name": "Cosmic Channeling",
    "tags": ["mutation", "ka", "cosmic"],
    "flavor": "All magic. From the same void.",
    "ranks": [
      "When the hero sees a spell cast, they may make a moderate aura test to see if they grab an echo of the spell in their ego-matrix (inventory). They can cast each echo once. The spell price must still be paid.",
      "Spell echo prices are halved.",
      "It is now an easy test to capture spell echoes."]},
  "crawlspacer": {
    "name": "Crawlspacer",
    "tags": ["voyager","trait"],
    "flavor": "Adapted to life on space-stations. Adept at functioning in tightly cramped environments.",
    "ranks": [
      "No penalties to tests for being in constricting environments.",
      "Can flee from combats even in constricting environments. Can move through allies and enemies in combat.",
      "[+] to tests in constricting environments."]},
  "criticalmaster": {
    "name": "Critical Master",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Knows where it hurts.",
    "ranks": [
      "Hero’s critical hit multiplier is now equal to their proficiency or x3, whichever is higher.",
      "Critical hit multiplier is now equal to level, proficiency or x4, whichever is higher (max x6).",
      "Multiplier is now equal to level or x5, whichever is higher (max x8)"]},
  "deathhunger": {
    "name": "Death Hunger",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Death awakens the blood demon.",
    "ranks": [
      "Player tracks enemies taken out by the hero in a battle scene. Each enemy taken out grants a cumulative +1 to attacks until the end of the scene.",
      "Hero also gains cumulative +1 to damage for every enemy taken out.",
      "Hero also regains 1d6 life for every enemy dropped."]},
  "deepskillaugmentation": {
    "name": "Deep Skill Augmentation",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "A protein machine ghost infects the hero’s brain, feeding them memories and skills from someone long dead.",
    "ranks": [
      "Hero gains [+] to all tests with one of their skills.",
      "Hero gains [+] with a second skill. One mental stat increases by 1, another stat decreases by 1.",
      "Rewiring is completed. The hero becomes tetrachromatic, seeing a wider spectrum of colours. They gain +1 charisma. The ghost of a dead personality becomes a lodger in their brain."]},
  "devastator": {
    "name": "Devastator",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Damage is everything.",
    "ranks": [
      "Hero’s attacks always deal extra damage equal to their proficiency or +3, whichever is higher.",
      "Extra damage is now equal to their level, proficiency or +4, whichever is higher.",
      "Extra damage is equal to level or +6, whichever is higher."]},
  "disembodied": {
    "name": "Disembodied",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "Has no eyes to weep.",
    "description": "(Manifesting in a sentient form usually causes a more-or-less violent aura contest for control between the hero and the form.)",
    "ranks": [
      "The hero is a disembodied spirit-personality (ka-ba). They are immune to physical attacks, but their direct interaction with the physical world is also limited. They cannot exert a force more substantial than a gentle breeze or a slight temperature differential by themselves.",
      "Their direct force is as strong as a stiff breeze or a moderate temperature difference. They can manifest within a pig-sized object, perhaps a chest or a skeleton. This manifestation costs 2 life per hour or so.",
      "They can create a strong gust of wind or a sharp temperature difference. They can also manifest within a boulder-sized object, perhaps a house or dinosaur. This manifestation costs 4 life per hour or so."]},
  "dosemaster": {
    "name": "Dosemaster",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Measured in all things.",
    "ranks": [
      "Hero knows their doses. They don’t roll dice when healing with meds and potions or when applying poisons. Instead, they treat the maximum result as the number of charges. E.g., a med that normally restores 1d8 life always restores 8 life in the dosemaster's capable hands.",
      "Hero rolls an additional matching die, increasing the charges they can nurse out of a med dose.",
      "Hero can microdose poisons and meds, using them to provide resistance to similar poisons, vaccinating against diseases, and doubling the effects of potions."]},
  "doublemajor": {
    "name": "Double Major",
    "tags": ["voyager","trait"],
    "flavor": "",
    "ranks": [
      "This trait can only be acquired through character generation. Choose a skill and replace this trait with it."]},
  "eaterscurse": {
    "name": "Eater’s Curse",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "Its hunger shall consume the cosmos.",
    "ranks": [
      "Teeth fall out. Chewing is difficult.",
      "Needle-sharp fangs, translucent like those of a deep-sea fish, grow profusely from the softened gums. Chewing is impossible.",
      "Fangs turn hard and black, mouth grows unnaturally wide, jaw develops hinges. Hero gains a bite attack (1d4).",
      "Entire head unfolds into biting maw. Bite attack (1d8)."]},
  "echolocator": {
    "name": "Echolocator",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Voices paint pictures.",
    "ranks": [
      "Hero can use echolocation. Gains 1 agility.",
      "Hero can dimly see around corners and through closed doors using echolocation and vibrations. Gains 1 agility.",
      "Hero can detect heartbeats, subvocal tics, breathing rates, and blood pressure by sound and touch. Gains 1 aura and [+] to detecting inconsistencies."]},
  "electromagichacker": {
    "name": "Electromagic Hacker",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Talk long enough into the machine, and it will talk back.",
    "ranks": [
      "Hero can hack adjacent oldtech creatures and equipment. In combat, hacking is one action, each command is another action.",
      "[+] to hacking tests if touching target.",
      "Hero can give target one free command per turn."]},
  "emptyshell": {
    "name": "Empty Shell",
    "tags": ["trait", "ka", "technological"],
    "flavor": "No hell or heaven awaits.",
    "ranks": [
      "Hero has no soul or ka. All curse spells always fail against them. Their ka defence is permanently 7, and cannot be modified. They are resistant against all ka damage. They can never be restored to life if killed.",
      "Hero can absorb a soul leaving its dying body, gaining 1 aura until the next session. This destroys the absorbed soul. While they have an absorbed soul, they appear normal and not like a soulless husk.",
      "Their ka defence is permanently 13. They are resistant to all magical damage."]},
  "enduranceofecstasy": {
    "name": "Endurance of Ecstasy",
    "tags": ["mutation", "ha"],
    "flavor": "Through the joy of existence shared, all sufferings are easier.",
    "ranks": [
      "+1 endurance and maximum endurance increased to 6. ",
      "+1 endurance, max to 7.",
      "+2 endurance or hero gains two bonus slots for burdens."]},
  "eternalchampion": {
    "name": "Eternal Champion",
    "tags": ["trait", "ba", "cosmic"],
    "flavor": "Carrying the torch of purpose beyond the gates of time and hate.",
    "description": "(This ability is not compatible with abilities that decrease a hero’s magic cost.)",
    "ranks": [
      "Hero bonds with an eternal weapon (an L3 sidekick), sometimes as its master, sometimes as its slave. They apply their proficiency to tests with their eternal weapon, even if they don’t have a relevant skill. Further, the hero’s life increases by 1 point for each of their levels (current and future). Also, they can use their eternal weapon’s life for spell-casting. But their magic cost is increased by 1.",
      "When wielding the eternal weapon, all defences are increased by their proficiency. E.g., a hero with pro +2 increases every defence from 10 to 12.",
      "When wielding the eternal weapon, all the hero’s critical hit damage multipliers are increased by their proficiency. E.g., pro +4 increases a multiplier from x2 to x6. This applies to all attacks, not just with the weapon."]},
  "existentialdysfunction": {
    "name": "Existential Dysfunction",
    "tags": ["mutation", "ka", "cosmic"],
    "flavor": "Beyond reality, other ways.",
    "ranks": [
      "A barely perceptible darkness cloaks the hero, like diaphanous wreaths of pure nothingness. They become sensitive to bright lights.",
      "The dark between stars now obviously wreathes the hero. They walk in shadow even on the brightest of days. Bright radiation or sanctified memory waters cause physical pain.",
      "The void seeps into the hero, making them colourless and darkly-shaded. Smoke curls within their eyes and even in darkest night a faint ur-hue lets them find their way.",
      "The hero is no longer quite there, appearing as somehow translucent and absent. They have a harder time interacting with the physical world and carrying heavy loads. At the same time, the world also has a harder time affecting them. "]},
  "expertsidekicks": {
    "name": "Expert Sidekicks",
    "tags": ["trait", "ba", "social"],
    "flavor": "Friends are the best.",
    "ranks": [
      "A number of sidekicks equal to the hero’s proficiency can be experts. This means they add the hero’s proficiency to their sum when testing something they’re good at.",
      "The number of possible expert sidekicks increases to the hero’s level or proficiency or 4, whichever is highest.",
      "The hero’s expert sidekicks add twice the hero’s proficiency."]},
  "extraordinaryprecognition": {
    "name": "Extraordinary Precognition",
    "tags": ["mutation", "ka", "psionic"],
    "flavor": "Feel the pain of the future.",
    "ranks": [
      "Hero can glimpse the future. It hurts. Spend 1 life to gain [+] on any test to avoid damage.",
      "Subconscious packing. The hero can bundle up an undefined item no larger than one stone. At an opportune moment, it turns out to be mundane but useful.",
      "Dooms were always written. When disaster befalls the hero and their companions, the hero can spend 7 life and one prized possession. All along, they were not there. They had even warned their companions, but they chose not to listen. The hero makes their escape, aware that there was truly nothing they could do to save anybody but themselves. "]},
  "fingersoftheotherside": {
    "name": "Fingers of the Other Side",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "Reality will conform to revelation.",
    "ranks": [
      {
        "base": "Vestigial fingers or toes protrude from the flesh on the hero’s ",
        "entries": ["flanks", "arms", "legs", "back"],
        "end": "."
      },
      "The digits elongate and become as strong as those on the hero’s hands.",
      "The digits grow even longer, more powerful, with more joints, like a cross between fingers and sinewy spider legs.",
      "The digits are so many and so powerful they can unfold like a fan and easily trap or catch anything trying to pass by."]},
  "fleshsongaudiophile": {
    "name": "Fleshsong Audiophile",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Codes of creation singing in the flesh of the mortal and damned.",
    "ranks": [
      "Hero is creepily well acquainted with biology; [+] to all biological research tests. When they touch flesh, it sings and tells them what it has experienced. After a few minutes of physical contact, they can ask or answer one question about a living creature's medical history and condition.",
      "[+] to all biological tests, including biomancer spells. Flesh songs answer questions about medical histories of dead organisms.",
      "Can detect presence of living creatures now and in the past from environmental residues—traces in dirt and water—from touch alone."]},
  "fluidanatomy": {
    "name": "Fluid Anatomy",
    "tags": ["trait", "ha", "chimerism"],
    "flavor": "They have organs they shouldn’t have in places they shouldn’t be.",
    "ranks": [
      "Hero's insides rearrange and rebuild to keep them going despite dreadful trauma. Hero can spend 1 stat point to turn a critical hit into a normal hit.",
      "Can spend 1 stat point to regain life equal to hero’s level.",
      "Can remove 1 burden per session."]},
  "foolsluck": {
    "name": "Fool’s Luck",
    "tags": ["trait", "ba", "cosmic"],
    "flavor": "They don’t know their luck.",
    "ranks": [
      "Hero rerolls every natural 1.",
      "Hero gains [+] to tests when they have no relevant skill.",
      "Everytime they roll a natural 1, they gain a [+] to their next roll."]},
  "friendoftheelement": {
    "name": "Friend of the Element",
    "tags": ["trait", "ba", "cosmic"],
    "flavor": "Accept the love of the source.",
    "description": "Hero is beloved of ",
    "table": [
      "Light",
      "Fire",
      "Sky ",
      "Water",
      "Green",
      "Metal",
      "Radiation",
      "Void"
    ],
    "ranks": [
      "Hero gains [+] to all elemental attacks.",
      "Hero now has [+] to all element-related die-rolls, including damage.",
      "Hero always deals double damage with element."]},
  "thefurferal": {
    "name": "The Fur Feral",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "The wild will break free.",
    "ranks": [
      "The body grows heavy, beset by chronic fatigue. Hairs become thorn-like, nails thicken and curl.",
      "Follicles grow oversized, and masses of keratinous fibres replace normal hair, covering the body in a spongy layer. Movement becomes clumsy, but blows are cushioned (+1 ha defence).",
      "Prolific, heavy ropes of keratin grow from the body constantly (1 stone’s worth per day). Appetite increases. Unless the ropes are cut regularly, they quickly overwhelm the hero’s ability to move.",
      {
        "base": "The keratin growth diversifies, covering the unrecognizable hero in swift-growing ",
        "entries": [
          "shiny scales",
          "sharp spines",
          "thick fur",
          "luxurious feathers"
        ],
        "end": "."
      }
    ]
  },
  "futureproof": {
    "name": "Futureproof",
    "tags": ["trait", "ka", "technological"],
    "flavor": "The hubris of technology, undone.",
    "description": "Technology abhors you. Machinery crumbles at your touch. Lasers glance off you like water off a duck.",
    "ranks": [
      "[+] to tests against technological effects or targets. Hero suffers [-] when using technological items.",
      "Hero's touch deals 1d8 damage to machines. They can no longer use advanced technological items.",
      "Machines touched by the hero make a relevant ha (or ka if available) test or shut down. Sentient machines dislike the hero."]},
  "gastrointestinalupgrade": {
    "name": "Gastrointestinal Upgrade",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Everything should be fuel.",
    "ranks": [
      "Hero’s gut is a marvel of technomagic. They are immune to food poisoning and gain [+] vs. all other ingested toxins. Also, they can digest anything organic, from wood to bone to petroleum.",
      "Hero has a matter converter installed in their body and can derive sustenance from inorganic material.",
      "Hero has a ka-mill in their wormhole heart. They eat the souls of their victims, temporarily increasing their life total by 1d6 points for every level of a creature they ritually consume (to a maxi-mum equal to their life total)."]},
  "gentletraveller": {
    "name": "Gentle Traveller",
    "tags": ["trait", "ba", "social"],
    "flavor": "Oh, what wonders!",
    "ranks": [
      "Favourite travelling bag. Hero gains a special inventory that can hold 3 stone-sized items or 99 soap-sized items. It’s magical. If they lose the bag, it always somehow reappears.",
      {
        "base": "Personal daimon. Hero gains a little voice that whispers in their ear. It does not occupy an inventory slot, but does require a name. Once per game session, the daimon gives one of the following:",
        "entries": [
          "Good luck. Player sets a rolled die to the face they want.",
          "Health. The daimon restores one of the hero’s attributes.",
          "Wisdom. Daimon gives a true answer to one riddle, conun-drum, or other problem."
        ],
        "end": ""
      }
    ]
  },
  "gifted": {
    "name": "Gifted",
    "tags": ["trait", "ha", "ka", "ba", "cosmic"],
    "flavor": "They have that special touch.",
    "ranks": [
      "Hero’s pro increases by 1.",
      "Increases by 1 more.",
      "Increases 1 more."]},
  "glitteringincorruptible": {
    "name": "Glittering Incorruptible",
    "tags": ["trait", "ha", "ba", "technological"],
    "flavor": "The body is a temple of purity.",
    "ranks": [
      "Hero’s source code has been enhanced by chance or ancient germline intervention. The hero cannot suffer mutations through corruption. Instead, they take a point of harm. The ill hero requires a week’s rest to recover.",
      "Hero’s source code actively resists all diseases and toxins. Hero can choose to lose 1 stat point to avoid all other effects of a disease or poison.",
      "Hero can not be reduced to 0 life through social attacks. They are simply too golden."]},
  "goodnightmessenger": {
    "name": "Goodnight Messenger",
    "tags": ["trait", "ka", "technological"],
    "flavor": "The end. The end.",
    "description": "They are a subconscious message from the ",
    "table": [
      "Backup iteration",
      "Beginning of this cosmos",
      "Eating dark",
      "End of time",
      "Divine renaissance ark",
      "Wormway engineers"
    ],
    "ranks": [
      "Sub-creation antenna. Hero gains a boon [+] whenever someone near them casts a spell.",
      "Unraveller. Hero gains resistence to magic damage. All spell effects near them explode.",
      "Entropy prophet. Hero gains ka defence equal to their level. All spell damage dice near the hero are increased by their level."]},
  "gravitas": {
    "name": "Gravitas",
    "tags": ["trait", "ba", "social"],
    "flavor": "The presence abides.",
    "ranks": [
      "Hero’s mere presence is an argument. They can choose to use their aura or endurance stat when making social tests.",
      "Additionally, can add  aura or endurance to dice rolled during social conflicts.",
      "Increase aura or endurance by 1. May use their aura or endurance stat for ba defences."]},
  "hackedshorttimer": {
    "name": "Hacked Shorttimer",
    "tags": ["trait", "ha", "technological"],
    "flavor": "We were better for a while.",
    "ranks": [
      "Hero comes from stock crudely optimized for improved short term performance. They gain 1 strength, endurance, or agility. Sadly, their bio-cobbled body imposes [-] against diseases, venoms, or toxins.",
      "The optimization went further than was wise. Hero gains 1 more strength, endurance, or agility. Their physical stat maximum is increased to 6. Alas, they suffer [+] damage from one type of attack: physical, social, or mental.",
      "Flawed divinity. Hero gains 1 more strength, endurance, or agility, and 1 charisma. Their physical stat maximum is increased to 7. Hero suffers [-] against one kind of elemental assault."]},
  "honourbound": {
    "name": "Honour Bound",
    "tags": ["trait", "ba", "social"],
    "flavor": "Where courts dare not tread, honour is the law.",
    "ranks": [
      "Hero possesses an aura of honour, granting [+] to social tests in nomadic and clan-based societies.",
      "Powerful mana protects the hero from dishounorable opponents (i.e. city-dwellers or hunter-gatherers). Their social attacks against the hero have [-].",
      "Tribal aura. Hero takes half damage from all social attacks in the wild lands."]},
  "hostileheavensarmor": {
    "name": "Hostile Heaven’s Armour",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "In the heavens, there is only war.",

    "ranks": [
      "Strange bones erupt from the skin. Clothes fit ill.",
      "Bones grow into jutting spikes, blades, and ridges. Wearing armour becomes next to impossible. Attackers may be injured (1d4 damage).",
      "Elaborate spines, hooks, and plates cover the hero, defending them from attack (+2 ha defence) and increasing their threat (1d6 natural damage).",
      "The bony structures develop into a terrifying suit of biological armour (+5 ha defence)."]},
  "hyperlogical": {
    "name": "Hyperlogical",
    "tags": ["trait", "ka"],
    "flavor": "Who needs a heart anyway?",
    "ranks": [
      "Immune to fear, charm, and emotional appeals. [-] to reading social cues. [+] to logical reasoning.",
      "All according to plan. Gains [+] to tests on the second and subsequent rounds of a conflict.",
      "Necessary sacrifices. Gains 1 action whenever an ally is defeated in a conflict. Gains 1 life whenever an ally is injured. Gains [+] whenever they are injured."]},
  "idleonesclaws": {
    "name": "Idle One’s Claws",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "The predator does not work, it takes.",
    "ranks": [
      "Random hand withers and weakens. Using tools with that hand becomes difficult.",
      "Hand locks into a deformed claw. Using tools is impossible.",
      "Bones and gristle flow and reform into a trefoil ripping, cutting claw array. Hero gains an unarmed attack (1d6).",
      {
        "base": "The claws bleed void stuff into this near world. The merest scratch from them causes ",
        "entries": [
          "paralysis",
          "acute formication",
          "hyperalgesia",
          "muscle spasms"
        ],
        "end": "."
      }
    ]
  },
  "improved": {
    "name": "Improved",
    "tags": ["trait", "technological"],
    "flavor": "A fantascience product.",
    "ranks": [
      "Hero chooses a beneficial mutation.",
      "Hero gains 1 stat point and chooses a mutation.",
      "Hero gains gains 1 more stat point and a mutation or trait."]},
  "ineffablepatternsofbeing": {
    "name": "Ineffable Patterns of Being",
    "tags": ["mutation", "ka", "cosmic"],
    "flavor": "ERROR. Reality compile fail. There is no abort, there is only retry.",
    "ranks": [
      "Intelligence is reduced. Hero’s twitching mind cannot avoid alien things lurking in the corners of reality.",
      "Personality becomes alien. Hero no longer feels some human emotions while acquiring other stranger ones.",
      "Mind becomes temporally scattered. Hero gains mild precognition, avoiding immediate threats with unnatural speed and precision. At the same time, they can no longer focus on the here and now.",
      {
        "base": "Hero’s ba or personality is smeared out completely, replaced by something alien. Hero becomes immune to all mental attacks and acquires an ineffable goal, perhaps to ",
        "entries": [
          "create odd patterns at energy interstices",
          "collect words and memories from key individuals",
          "paint alien murals on symbolic objects",
          "sing chants in the ruins of elder time"
        ],
        "end": "."
      }
    ]
  },
  "inspiringhero": {
    "name": "Inspiring Hero",
    "tags": ["trait", "ba", "combat"],
    "flavor": "For great glory!",
    "description": "The intangible quality of a leader has a quantity all of its own.",
    "ranks": [
      "A number of sidekicks equal to the hero’s proficiency fights with unmatched ferocity. They add the hero’s proficiency score to all their attacks and tests during battle scenes.",
      "The number of possible inspired sidekicks increases to the hero’s level or proficiency or 4, whichever is highest."]},
  "insufferablycute": {
    "name": "Insufferably Cute",
    "tags": ["trait", "ba", "social"],
    "flavor": "Just the cutest.",
    "ranks": [
      "A winsome face. [+] to social interactions, but all interactions take twice as long as everyone fusses over the hero.",
      "Small and cuddly. [-] to all direct attacks against the hero, but the hero’s inventory is permanently reduced by 3.",
      "Mascot. All allies near the hero gain [+] while protecting them."]},
  "jadebrain": {
    "name": "Jade Brain",
    "tags": ["trait", "ka", "technological"],
    "flavor": "There are colours beyond god.",
    "ranks": [
      "Hero’s brain is replaced with a perfect crystal. At any time, they can spend 1 life and 1 days to store a copy of their personality in a memory pearl. Hero also gains 1 thought.",
      "Hero gains a crystal third eye. They gain [+] to light and force tests. Hero also gains 1 aura.",
      "Hero can project their hopes and fears into others, gaining [+] when sharing their emotions or reading other’s intent. Hero also gains 1 ba and ka defence."]},
  "justtooordinary": {
    "name": "Just Too Ordinary",
    "tags": ["trait", "ba", "social"],
    "flavor": "Common as muck.",
    "ranks": [
      "Hero seems eminently ordinary. They can immediately lose themselves in a crowd. [+] to disguising them as someone else. Over time, they actually physically begin to resemble the average inhabitant of their locale.",
      "Catalyst. Hero gains [+] to shifting the mood of crowds they are a member of. When fighting with the rank and file, their companions gain [+] to tests. [+] to ba tests among lower classes.",
      "Social dynamite. Hero gains 1 charisma and can make themselves look completely striking and unforgettable. [+] to ba rolls against different social classes. Can spend 1 life encoura-ging nearby allies, giving them [+] to rolls for the rest of the round."]},
  "kamarked": {
    "name": "Ka Marked",
    "tags": ["trait", "ba", "cosmic"],
    "flavor": "Chosen by the overgods.",
    "description": "Hero’s soul bears the blazing mark of the ",
    "table": [
      "All-Purifying Engine",
      "Decaying Cosmos",
      "Deep All-Generator",
      "Eating Dark",
      "Endless Horizon",
      "Iron Guardian",
      "Morning Star",
      "Viridian Permutator"
    ],
    "ranks": [
      "Awesome self-confidence. Hero adds their charisma to ha and ka defence. Hero can also spend 1 life to detect sympatethic priests and believers in their vicinity. Such people love them.",
      "Dangerously infallible. Hero gains 1 charisma. Hero can also spend 1 life to ‘detect’ that an unsympathetic creature in their vicinity is evil and dangerous. They gain [+] to tests and damage rolls against this marked target.",
      "Hark the celestial voices. Hero adds their charisma to ha and ka attacks. The hero’s allies and other nearby sympathetic creatures gain [+] to rolls against targets marked by the hero."]},
  "lazarussoldier": {
    "name": "Lazarus Soldier",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Didn’t let them grind ya down.",
    "ranks": [
      "The first time the hero is reduced to 0 life in a session they immediately regain 6+level life.",
      "When the hero would be permanently removed from play, the player can return them into play in the next scene. The hero gains a permanent scar or burden occupying one inventory slot and loses a rank of Lazarus Soldier.",
      "After the hero dies, they return to life on the next full moon or another significant astrological event. This creates a probabilistic dysfunction and unleashes an undead plague."]},
  "lifeboundgift": {
    "name": "Lifebound Gift",
    "tags": ["mutation", "ha", "cosmic"],
    "flavor": "The hero’s being is bound more tightly to the given world. Their life force burns brighter.",
    "ranks": [
      "Hero gains +1 life for every current and future level.",
      "+1 more life per level.",
      "Hero gains a second, mystical heart, which holds 2 life for every current and future level. The hero can only use these life points to pay spell prices or as gifts to other living creatures."]},
  "lifewindinhalation": {
    "name": "Lifewind Inhalation",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Deep breaths, action hero.",
    "description": "Absorb the vital principles of sky and green through superior patterns of consciousness.",
    "ranks": [
      "Hero recovers twice as much life when spending a hero die to recover life.",
      "Thrice as much life. Additionally, spending a hero die to recover life grants one boon.",
      "Four times. Additionally, spending a hero die to recover life makes them glow bright as a torch for a few hours."]},
  "lucklessmess": {
    "name": "Luckless Mess",
    "tags": ["trait", "cosmic"],
    "flavor": "Everything goes wrong.",
    "ranks": [
      "Hero and all creatures near hero increase critical fail range 1 step. Hero’s critical failures are always humorous, never actually harmful.",
      "Whenever anybody rolls a critical failure nearby, the hero regains a hero die.",
      "Critical fail ranges increase 1 more step. The hero gains 1d6 life or 1 stat point whenever anybody near them rolls a critical failure."]},
  "luminous": {
    "name": "Luminous",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Let the light shine out.",
    "ranks": [
      "The hero’s insides are aglow. They can release it from their mouth or eyes with the radiance of a powerful torch.",
      "Hero gains [+] to ka attacks and magic tests in brightly illuminated spaces.",
      "They sparkle like diamonds and are resistant to physical damage in bright light."]},
  "machinewhisperer": {
    "name": "Machine Whisperer",
    "tags": ["trait", "ba", "technological"],
    "flavor": "Soothe the savage robot.",
    "ranks": [
      "Talking machines naturally like the hero. [+] to social tests with machines.",
      "Complex machines always try to help the hero. Complicated locks try to unlock themselves when whispered to, audio-visual orbs try to fix themselves when banged vigorously.",
      "[+] to effects when using machines. Golem guns do more damage, vechs leap further, cracklewand fields last longer."]},
  "magicmule": {
    "name": "Magic Mule",
    "tags": ["mutation", "ha"],
    "flavor": "Such broad shoulders, such strong back.",
    "ranks": [
      "The hero can carry twice as much as a normal human: two sacks without encumbrance, plus one cumbersome sack total. The additional sack can only hold physical objects.",
      "The hero can carry two additional cumbersome sacks.",
      "The hero can carry five additional cumbersome sacks for a total of ten. That’s about a ton."]},
  "masterblaster": {
    "name": "Master Blaster",
    "tags": ["trait", "ka", "combat"],
    "flavor": "Only Blaster leave!",
    "ranks": [
      "Hero rolls all exploding damage dice (e.g. 1d6*) with [+].",
      "[+] to all explosive tests, including attacks and spells. Hero feels the energy trapped in matter yearning to be free like a phoenix.",
      "Oops. Blaster blew up. Time for a new hero."]},
  "memorypalace": {
    "name": "Memory Palace",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "A prison of dreams traps the unwary.",
    "description": "A true wizard’s mind is a scary old palace, full of dark holes where magical parasites hide.",
    "ranks": [
      "The hero squirrels away extra spell burdens in their mind as magic memories. The memory palace has a number of magic rooms equal to their level. This is a bonus inventory just for carrying spells.",
      "Hero also gains memory points equal to their level. These are used to cast memorized spells as if they were life points.",
      "Hero’s memory point total from this ability is doubled."]},
  "metabolichyperdrive": {
    "name": "Metabolic Hyperdrive",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "The difference under the skin.",
    "ranks": [
      "The hero derives sustenance from anything organic, and their stomach is immune to organic poisons. Unfortunately, alcohol barely works on them anymore.",
      "Hero can slow down or accelerate their metabolism, either hibernating without food for months or spending 1 life to gain an additional action.",
      "Abmortality engines in the hero’s body keep their genetic source code in perfect condition and breakdown all toxins and drugs that might interfere with their functioning. The hero can also shutdown, going into a week-long debugging mode, which purges all harmful viruses and organisms from their body."]},
  "meticulousritualist": {
    "name": "Meticulous Ritualist",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Accurate ritual records must be kept for meaningful summoning!",
    "ranks": [
      "Hero gains [+] to tests when casting all spells taking over a dozen minutes to cast.",
      "Hero also rolls effects of their ritual spells with [+].",
      "Hero reduces price of all ritual spells they cast by 2 (minimum of 1)."]},
  "morethenhuman": {
    "name": "More Than Human",
    "tags": ["trait", "ba", "technological"],
    "flavor": "The cosmos gazing at itself.",
    "ranks": [
      "An awareness of common consciousness grants the hero [+] to communicating with synthetics, golems, and void creatures.",
      "The hero is incredibly versatile, adapting to alien dimensions, higher colours, strange gravities, and non-euclidean spaces within a few minutes. This negates environmental penalties, though the hero may still dies from exposure, lack of air, etc.",
      "Tapping the cosmic mind, the hero gains [+] to all social and mental interactions with alien sentiences. Additionally, the hero can willingly abandon their mortal shell and become a ka-ba spirit. This is a one-way trip. Afterwards, humans count as alien sentiences for the hero."]},
  "motorbreath": {
    "name": "Motorbreath",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Give me that which I desire.",
    "ranks": [
      "Hear the roar. [+] when using machines with engines.",
      "Eat the dust. Gains an extra action when using a machine with an engine.",
      "Break on through. [+] to damage and initiative with machines with engines. Critical range increased one step in vehicular combat."]},
  "naturalborncomrade": {
    "name": "Natural Born Comrade",
    "tags": ["trait", "ba", "social"],
    "flavor": "Icon of the hunter scavengers.",
    "ranks": [
      "Hero gains [+] to social tests among their equals. Whenever they give away most of their wealth in social conflict and keep an equal or smaller proportion for themselves, all their attacks are twice as effective.",
      "Wealthier opponents have [-] to social and physical attacks against the hero. Hero deals double social and physical damage to wealthier opponents.",
      "Hero suffers no penalties from opulent wealth in the eyes of the poor since they are only safeguarding the wealth for the common folk."]},
  "neuralmachinesymbiote": {
    "name": "Neural Machine Symbiote",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Silver ships slip through my veins.",
    "description": "Tiny silver animalcules flow through the hero’s bloodstream, glittering golden wires thread their neural networks.",
    "ranks": [
      "Hero can pilot golems and other thinking machines hands-free. The symbiote accelerates their mind (hero gains 1 thought).",
      "The symbiote accelerate all reflexes (hero gains 1 agility) and lets the hero talk with machines and other neurally enhanced humans at great distances.",
      "Join the silver collective. Hero gains 3 bonus inventory slots for mental constructs, memories, skills, or burdens. Gains [+] to any tests that require access to complex memories or data. Sometimes receives instructions from a collective neural identity."]},
  "neuroempathy": {
    "name": "Neuroempathy",
    "tags": ["trait", "ba", "social"],
    "flavor": "Mirror-neurons mirror neurons.",
    "description": "The hero says they always understand how others are feeling.",
    "ranks": [
      "Empathic projection. [+] when soothing, consoling, or other tests that require empathy.",
      "Full tele-empathy. Can read emotions of visible creatures. [+] against lies and deception.",
      "Empathic blot. Deals double ka or ba damage when making an emotional attack."]},
  "anewface": {
    "name": "A New Face",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "Hypocrisy stripped reveals a new visage.",
    "ranks": [
      {
        "base": "An additional eye and teeth develop on the ",
        "entries": [
          "hand or arm",
          "leg or foot",
          "back or shoulder",
          "chest or groin"
        ],
        "end": ". They are non-functional. If removed, they grow back."
      },
      "The eye becomes functional. Additional buds form. Cartilage and gums form around the teeth.",
      "A second eye joins the first. Nose-bud forms. A functional mouth forms around the teeth. The hero can ingest sustenance and speak with the second mouth.",
      {
        "base": "A complete face forms. Its distorted features can part to reveal a ",
        "entries": [
          "venomous bite",
          "fearsome gaze",
          "blood-sucking fangs",
          "voice like an angelic choir"
        ],
        "end": "."
      }
    ]
  },
  "noblesseobliged": {
    "name": "Noblesse Obliged",
    "tags": ["trait", "ba", "social"],
    "flavor": "Better folks are bred, not made.",
    "ranks": [
      "Hero owns a country estate and a fancy title. Social attacks can never remove the hero from play. Hero gains an additional hurt state, “attending to personal matters in the countryside.” This hurt state immediately removes the hero from play for the session. Still, it prevents further injury, as they are ensconced in their “cottage”.",
      "Lucky death of a relative brings finances to match the title. Hero gains [+] whenever money would be an issue. Because money, or at least credit, is not an issue.",
      "Friends in high places. Once per session, the hero can call on a favour to get out of a pickle or rum do. Hero gains [+] in all courts of law and public opinion."]},
  "oldtechimmunityghost": {
    "name": "Oldtech Immunity Ghost",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "The hero gains a semi-sentient distributed immune system.",
    "ranks": [
      "[+] to all tests against diseases, poisons, radiations, or other environmental effects.",
      "Their resistance turns to complete immunity, and they gain resistance to a second effect.",
      "Their second resistance also becomes immunity, and their immune system becomes a fully sentient hive-symbiote (L3, caustic) that communicates via direct brain link. The symbiote can perform molecular-level analyses of substances. It also has an acerbic sense of humour. "]},
  "omniactivation": {
    "name": "Omniactivation",
    "tags": ["trait", "ka", "technological"],
    "flavor": "The red button will be pushed.",
    "ranks": [
      "Hero ignores all restrictions on all fantascientific devices. Doors recognize them, sentient bombs talk to them. Does the hero understand what they do? Unlikely.",
      "Once per session, the hero can touch a dead fantascientific machine or artifact and it sparks to life, giving off one last gasp of utility. A dead autowagon rolls forward a last few meters. A visual calculator’s last output glows dimly on its cathode sphere for a few minutes. An electronic lock reactivates and bolts a door.",
      "When faced with any fantascientific creature, the hero can spend 1 life to ‘discover’ a backdoor switch. Even odds whether this weakens the creature, or activates a new mode."]},
  "optidroneupgrade": {
    "name": "Optidrone Upgrade",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "Eyes like the star gods.",
    "ranks": [
      "Hero’s eyes become as sharp as those of a hawk.",
      "Hero’s eyes gain the ability to see into the ultraviolet and infrared spectra.",
      "Hero gains the ability to remove their eyes and use them as remote drones. Each eye can survive for up to a day outside of its socket. It costs the hero 1 life and 1 hour to grow a new eye. They can grow as many eyes at a time as they have sockets."]},
  "overlookedbythegods": {
    "name": "Overlooked by the Gods",
    "tags": ["trait", "ba", "cosmic"],
    "flavor": "Omniscience is a lie.",
    "ranks": [
      "All holy or sacred tests rolled against the hero suffer [-].",
      "All curses and blessings have minimal effect against the hero. Hero gains 1 aura.",
      "Hero gains [+] to all attacks and direct tests against the extra-normal ‘gods’ and their ‘divine’ servitors. They just slide off those creatures’ perception fields."]},
  "panmolecularsensorium": {
    "name": "Panmolecular Sensorium",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Hear the songs of the oceans. Read stories in wind and stream.",
    "ranks": [
      "Hero’s sensorium is expanded with new cutaneous and olfactory organs that let them read trace molecular remains. Their sense of smell is as acute as a bloodhound’s, and they can ‘taste’ with their fingertips. [+] when tracking, testing food for poison, sampling fuel for impurities, and other such tests.",
      "Hero can literally smell emotions. [+] to discerning intentions, picking up lies, and ferreting out tricks.",
      "Hero detects submolecular changes in reality. They smell magic and gain +2 ka defences."]},
  "perfectlybalanced": {
    "name": "Perfectly Balanced",
    "tags": ["trait", "ka"],
    "flavor": "Suspended between steps.",
    "ranks": [
      "Hero always balances on any narrow surface or tight rope. Can also perfectly balance objects.",
      "Like water, hero never loses their mental or social equilibrium. Resistant to fear, shame, regret, worry, and anxiety.",
      "Gains [+] to balance competing claims and pass legal or moral judgements."]},
  "petowner": {
    "name": "Pet Owner",
    "tags": ["voyager", "trait", "ba"],
    "flavor": "Bonded with a lovable companion.",
    "ranks": [
      "This trait can only be acquired through character generation. Remove this trait and gain a random pet."]},
  "pheromonepanoply": {
    "name": "Pheromone Panoply",
    "tags": ["trait", "ha", "ba", "technological"],
    "flavor": "Scent worth a hundred memories.",
    "description": "Write poetry with biochemistry.",
    "ranks": [
      "The hero has modified biological chemo-factories in their body. These provide communication molecules on demand. [+] to charming or intimidating social attacks. Can scare away or ‘blind’ creatures like ants and termites that rely primarily on chemical signals for communication.",
      "Hero can use their pheromone panoply to communicate with and try to command insects or other creatures that depend on pheromones.",
      "Hero uses pheromones to enhance their mind-affecting ka and all ba attacks. Damage dice increase one step and become exploding."]},
  "plasticbonestructures": {
    "name": "Plastic Bone Structures",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "Flexibility at all costs.",
    "ranks": [
      "The hero can slowly adjust their bones’ shape and size, squeezing through small spaces, growing taller or shorter, or mimicking other people’s faces.",
      "The hero’s bones heal and set in hours. They might expand their bones into a crash cage, launch off a cliff, then reknit themselves. This would hurt.",
      "The hero adjusts their bones  so swiftly that they gain [+] in physical conflict when relevant."]},
  "playsetcorpus": {
    "name": "Playset Corpus",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "The body is a delicate playground.",
    "ranks": [
      "The hero’s joints become grotesquely hypermobile. Movement is slow and deliberate.",
      "Limbs strangely flexible. Additional joints appear. Though more agile, the hero is weaker. Clothes fit awkwardly. They can rotate their head like an owl.",
      "Shoulder girdle and hips can rotate freely, each vertebra can dislocate, each rib can waggle.",
      "Hero can rearrange their bone structure almost at will. Bones travel within their flesh, creating alien forms reminiscent of the vatula-vyakula of the Restless Second Creation."]},
  "pocketpacker": {
    "name": "Pocket Packer",
    "tags": ["trait", "ba"],
    "flavor": "More for everyone.",
    "ranks": [
      "Whenever the group discovers a nice pile of treasure, the hero pockets an extra €1d6 x level of valuables without any-body noticing. This is quantum treasure that appears without affecting the main horde. Hero also gains [+] to picking pockets.",
      "Hero can always nick an unmemorable souvenir or memento from any location, machine or creature without anybody noticing until it is too late. The extra coins they pocket are now worth €2d6 x level.",
      "The extra valuables are now worth €3d6 x level. Hero also gains [+] to gambling, card tricks, and using hidden weapons."]},
  "polybodyunity": {
    "name": "Polybody Unity",
    "tags": ["trait", "ka", "chimerism"],
    "flavor": "More bodies, more choices.",
    "description": "Multiple bodies are connected in a real-time glandular psyche-to-psyche network. Neither body has priority, and they have a single mind. The hero can have up to 3 bodies. Adding a body is very expensive. It takes about a week, and requires a surgeon-psychopomp. Each additional body is treated as a secondary character with its own physical stats and action pool. Each body beyond the first in visual range grants 5 life points. Area attacks against polybody characters multiply their damage by the number of bodies present. If a hero sends off a body on its own, the player decides how much life is assigned. The player can invest xp in a body to increase its stats and life totals as though it were an extra. Heroes may merge with a new body instead of outright stealing it. In this case, the player rolls a new set of mental stats and uses the set with a higher aura score. The hero gains one bonus skill and replaces a number of other skills equal to their new thought score.",
    "ranks": [
      "Hero has an additional body.",
      "Hero can have up to 6 bodies. Some of their bodies can be animals.",
      "Hero can have up to 9 bodies. Some of their bodies can be synthetics."]},
  "porcelainskin": {
    "name": "Porcelain Skin",
    "tags": ["trait", "ha", "technological"],
    "flavor": "They made people prettier once upon a time.",
    "ranks": [
      "Hero's uncannily smooth skin is resistant to diseases and scarring. Gains 1 charisma.",
      "Hero’s luminous skin is resistant to acid, chemicals and fire (half damage). Gains 1 more charisma.",
      "Hero’s diamond-smooth skin resists slashing and piercing damage. Gains 1 ha defence."]},
  "predatoryassimilator": {
    "name": "Predatory Assimilator",
    "tags": ["mutation", "ha"],
    "flavor": "Almost a ghoul.",
    "ranks": [
      "The hero heals by eating biomatter close to their basic body pattern. Recover 1 life for every stone of flesh consumed (an adult humanoid averages 10 stone). For humans: chimps and lemurs are good, pigs less so. In a healing-frenzy, they can ingest a stone of flesh per action.",
      "Recover 2 life for every stone or 1 stat for 5 stones.",
      "Recover 4 life for every stone or 1 stat for 2 stones. Remove 1 burden by consuming 10 stones and vomiting them out again (this does not restore life or stats)."]},
  "protectorofinnocents": {
    "name": "Protector of Innocents",
    "tags": ["trait", "ba", "combat"],
    "flavor": "Despite the gore, a noble cause.",
    "ranks": [
      "Hero gains [+] to attacks and tests when fighting to protect an unarmed or helpless innocent.",
      "Once per turn hero can instantly redirect an attack from a nearby creature to themselves (this is not an action). Hero can redirect additional attacks at the cost of 1 life per attack. Word gets around. Downtrodden communities scrape together resources to help the hero.",
      "[-] to all attacks and damage against the hero while defending an innocent."]},
  "proteaninfinity": {
    "name": "Protean Infinity",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "Fixity of form was a mistake.",
    "ranks": [
      "Bones become brittle and prone to breaking. Hero becomes more vulnerable to physical damage.",
      "Bones soften, while fluid organs develop and strengthen to provide stability.",
      "Bones dissolve entirely. Only sinew and cartilage support the now alien musculature. Staying vaguely bipedal is an effort. The face collapses and smears. Enclosing armour helps with mobility.",
      "Hero becomes a protean thing of strange organelles and fluid body plan."]},
  "protowizard": {
    "name": "Proto-Wizard",
    "tags": ["voyager","trait"],
    "flavor": "",
    "ranks": [
      "This trait can only be acquired through character generation. Randomly select a spell and replace this trait with it."]},
  "psionscion": {
    "name": "Psion Scion",
    "tags": ["trait", "ka", "psionic"],
    "flavor": "A soft blanket for the soul.",
    "ranks": [
      "Low-level empathic field grants [+] to trickery, lies, and illusions.",
      "[+] to direct mental attacks against a single target.",
      "Empathetic enlightenment. [+] to assist, console, and otherwise help scared and vulnerable creatures. Resistant to fear and trickery."]},
  "psioniceruption": {
    "name": "Psionic Eruption",
    "tags": ["mutation", "ka", "psionic"],
    "flavor": "Inhuman mental abilities. Fear awakens in baseliners’ hearts.",
    "ranks": [
      "Hero acquires a spell. When using this spell, their magic cost is always 1.",
      "Gains 2nd spell.",
      "Hero gains +2 ka defence."]},
  "qanatofpower": {
    "name": "Qanat of Power",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Hidden channels, rushing energies.",
    "ranks": [
      "The hero casts all spells as though they were 2 level higher.",
      "When the hero casts a spell, they channel 1 life point from the void, reducing their spell price.",
      "Casts as 4 levels higher."]},
  "querulouskvetch": {
    "name": "Querulous Kvetch",
    "tags": ["trait", "ba", "social"],
    "flavor": "Complaining is a cure.",
    "ranks": [
      "Instead of any other burden, the hero may choose the special burden: “grumbling quietly.” It imposes no penalties. Hero can only bear one such burden at a time.",
      "Hero gains a second special burden: “griping and groaning.” When the hero gains this burden, sneaking becomes difficult [-].",
      "Hero gains a third special burden: “kvetching viciously.” When the hero gains this burden, they suffer [-] to social inter-actions. They also gain [+] to one action per round."]},
  "radiantpanoptics": {
    "name": "Radiant Panoptics",
    "tags": ["trait", "ka", "technological"],
    "flavor": "The inverse of colour blindness. Redline machine microbes swirl in the hero’s eyes.",
    "ranks": [
      "Hero’s infraoptic symbiotes detect heat signatures and traces. Gains [+] to survival and investigation tests.",
      "Hero can “see” in the absence of visible light using a panoply of electromagnetic sense organs.",
      "Hero’s senses can probe through several layers of base matter. Gains [+] when searching for hidden objects or trying to figure out if somebody is standing behind the draperies."]},
  "radiationsskin": {
    "name": "Radiation’s Skin",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "The fires of the celestial truths were not made to reside within the skin of man.",

    "ranks": [
      "Skin becomes flaky, pale, and colourless. It is usually cold to the touch.",
      "Suppurating boils weep around the edges of chitinous growths. Hero gains natural leathery armour (+1 ha defence).",
      "Skin continually rots and sloughs off in translucent, malodorous sheets. Escape bonds and restrictions more easily.",
      "Skin is entirely replaced with a ghostly radiant aura that leaves faint burns and bruises on organic materials. The aura-skin gives off a greenish light, strong enough to read by if one squints."]},
  "rauberbaron": {
    "name": "Rauber Baron",
    "tags": ["trait", "ba", "social"],
    "flavor": "Money is magic.",
    "ranks": [
      "Hero is savvy. Hero has [+] to all business-related rolls. Including treasure rolls.",
      "Hero is surprisingly well-off. Hero can deal physical damage with social attacks. It’s called paid help. Once per session, they acquire an expensive item on “credit”.",
      "Hero reveals they have a servile butler running a monopolistic corporation on their behalf. Hero can deal mental damage with social attacks. It’s called owning a media subsidiary. Once per session, they turn out to own a useful building or asset."]},
  "renownedracer": {
    "name": "Renowned Racer",
    "tags": ["trait", "ka", "technological"],
    "flavor": "The grand velocity trophy proves life has meaning.",
    "ranks": [
      "[+] to tests during vehicular chases. Fame (and notoriety) also grant the hero [+] in many social interactions.",
      "Some of them were death races. [+] when manoeuvring to attack or defend with a vehicle.",
      "Gains an extra driving action every turn."]},
  "rubberskin": {
    "name": "Rubberskin",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Nemesis of the thunder demons.",
    "description": "Skin laced with symbiotic insulating caucho-fungoid.",
    "ranks": [
      "The hero is resistant to electromagical and energy attacks (halving all damage).",
      "The caucho-fungoid is interwoven with the whole body. Immune to electromagical and energy attacks.",
      "No longer fully human but an evolved caucho-fungoid chimera. Electromagic and energy attacks heal the hero. They don’t repair broken bones or open wounds. Those still need surgery."]},
  "secretweapon": {
    "name": "Secret Weapon",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "They were the weapon all along.",
    "ranks": [
      {
        "base": "",
        "entries": [
          "Claws are hidden in the hero’s fingers (1d4).",
          "Blades are hidden in the hero's arms (1d6).",
          "Hero has venomous fangs (1d3, poison).",
          "Hero has blades in their feet (1d6).",
          "God blaster in the belly (3d6).",
          "Third set of barbed, void-hooked limbs in shoulder blades (1d8)."
        ],
        "end": ""
      },
      "Damage increased 1 step.",
      "Damage increased 1 more step and +1 ha defence."]},
  "securedflesh": {
    "name": "Secured Flesh",
    "tags": ["trait", "ha", "technological"],
    "flavor": "I am that I am.",
    "description": "The hero knows how their body works, keeping it strong and stable.",
    "ranks": [
      "[+] to all tests against mutations, dangerous spells, or anything else that might corrupt their body (e.g. disease).",
      "Hero takes half damage from toxins, venoms, poisons, and diseases. Hero recovers maximum life from hero dice.",
      "Regeneration backup. Hero removes 1 physical burden per night of sleep. Hero recovers double life from hero dice."]},
  "selfimprovementprotocols": {
    "name": "Self-Improvement Protocols",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Machines in the bloodstream do what they will.",
    "description": [
      "(Each installed upgrade reduces a stat by 1 to a minimum of 0. If all of a hero’s stats are at 0, they need to uninstall an upgrade before getting a new one.)"
    ],
    "ranks": [
      "The hero is upgraded with photovoltaics, feeding only on light, and a direct machine communication array. However, their biological body degrades due to inevitable errors integrating the ancient biomachines, permanently reducing a stat by 1.",
      "The hero’s upgrade capacity is increased. They gain 1 biomachine slot per level (maximum of 5) in addition to their regular inventory. They may choose upgrades from the corruption and mutation tables.",
      "Their upgrade capacity is increased to 2 biomachine slots per level (maximum of 11)."]},
  "signofthethirdhand": {
    "name": "Sign of the Third Hand",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "New hands reach new truths.",
    "ranks": [
      {
        "base": "A vestigial ",
        "entries": [
          "tail",
          "arm",
          "tentacle",
          "arthropod limb grows on the body"
        ],
        "end": ". It dangles uselessly. If cut off, it grows back."
      },
      "Limb grows stronger. Capable of picking up light objects. Clothes no longer fit.",
      "The new appendage grows larger and stronger than the original limbs. The whole hero can lift themselves by their third ‘arm’. Additional vestigial limb buds form.",
      "Another appendage, just as powerful, bursts forth. Limb buds stud the body."]},
  "skybroughtcurse": {
    "name": "Sky-Brought Curse",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "They sailed on wings among the galaxies.",
    "ranks": [
      "Vestigial wings or flagellae bulge and flail on the hero’s back.",
      "The primitive wings erupt in a tangle of membranes, struts, and tines. The hero can slow their fall or boost their jump. ",
      "The wings look like nothing this-worldly, but they let the hero glide convincingly. The hero’s entire body structure adapts to support the odd structures. Falls no longer kill.",
      "The massive powered wings drain bone and gristle and flesh from the rest of the hero, leaving them stick-thin but capable of flight."]},
  "songwormed": {
    "name": "Song Wormed",
    "tags": ["mutation", "ka", "cosmic"],
    "flavor": "There are songs in the lines of creation.",
    "ranks": [
      "Ears wither away to nubs. Hearing is impaired.",
      {
        "base": "Strange organs spread across the hero’s head from the ruined nubs of their ears. Hearing is very impaired. Hero gains the ability to detect ",
        "entries": [
          "magnetic fields",
          "electric currents",
          "radio waves",
          "magitechnic emanations"
        ],
        "end": "."
      },
      "Lacy, antennae-like horns erupt from the hero’s head, letting them understand the strange radiations they could previously only detect."]},
  "sparklefingers": {
    "name": "Sparklefingers",
    "tags": ["trait", "ka", "technological", "combat"],
    "flavor": "Conducting the ambient electromagic of the world.",
    "ranks": [
      "The hero's unarmed attacks can deal 1d4 electric damage instead of 1d3 physical damage. Conducting materials extend attack range.",
      "Electric touch increases to 1d6 damage. Hero can spend a few hours to recharge dead batteries.",
      "Increases to 1d8 damage. In medical settings hero's touch gives [+] or [-]; restarting stopped hearts, improving muscle tone, reducing viral replication."]},
  "specialization": {
    "name": "Specialization",
    "tags": ["voyager","trait"],
    "flavor": "",
    "ranks": [
      "This trait can only be acquired through character generation. Remove this trait and rank up a skill."]},
  "spiritbreaker": {
    "name": "Spiritbreaker",
    "tags": ["trait", "ka", "combat"],
    "flavor": "Make their noses bleed..",
    "ranks": [
      "When hero spiritually strikes an opponent of lower level than themselves, the opponent is out of the conflict (and probably unconscious).",
      "When the hero knocks an opponent out of the conflict, they get a free ka attack against a nearby target.",
      "When the hero’s ka attack hits, they gain 1d4 life."]},
  "spelldetonator": {
    "name": "Spell Detonator",
    "tags": ["trait", "ka", "combat"],
    "flavor": "Things must boom.",
    "ranks": [
      "Hero’s spell damage dice become explosive. E.g., a magic bullet (1d4) becomes 1d4*.",
      "Spell damage dice explode on highest & second-highest rolls.",
      "[+] to all spell damage."]},
  "stargazer": {
    "name": "Stargazer",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "Through madness, enlightenment.",
    "description": "Gazed upon Mother Star and saw through the Veil of Ignorance cast upon humanity by the Dark Sorcerer at the top of the false heaven. Saw through their whips and chains, and now they are as gossamer.",
    "ranks": [
      "[+] to all tests against magic.",
      "The moon-tide roars within the hero. They deal double damage to magic-corrupted monsters and abominations. And dark wizards.",
      "Enlightened. Immune to madness. Resistant to chaos, confusion and the pain of existence."]},
  "strengthofthesolitarysun": {
    "name": "Strength of the Solitary Sun",
    "tags": ["mutation", "ha"],
    "flavor": "As though powered by the nuclear furnaces of the cosmos itself.",
    "ranks": [
      "+1 strength and maximum strength increased to 6.",
      "+1 strength, max to 7.",
      "+2 strength or max to 9."]},
  "symbioticfriend": {
    "name": "Symbiotic Friend",
    "tags": ["trait", "ba", "technological"],
    "flavor": "There’s a little more than me.",
    "description": "The hero has a small, telepathically bonded pet living on or in their flesh. It is a ",
    "table": [
      "Chirping monkey-lizard",
      "Air-breathing fish",
      "Furry rabbit-snake",
      "Many-handed cuttlefish",
      "Rainbow land-crab",
      "Glistening biomech newt",
      "Burrowing glass bird",
      "Iridescent scarab colony"
    ],
    "ranks": [
      "The symbiotic friend can perform a single skill with the same bonus as the hero. It occupies no inventory slots.",
      "The friend is an expert, using double the hero’s pro score.",
      "It is an incarnation of skill. Its sum with that skill is +13."]},
  "symbolicreceiver": {
    "name": "Symbolic Receiver",
    "tags": ["trait", "ka", "technological"],
    "flavor": "That’s … that’s not really a thing.",
    "description": "There are patterns everywhere, and they all emit meaning into the receiver’s head. The hero knows what every symbol means, or says they do.",
    "ranks": [
      "Hero can always tell if a symbol is positive or negative. Price of all symbolic spells reduced by 1 (minimum 1). Symbolic spells include magic circles, magical exploding symbol traps, and the like.",
      "[+] to all tests when casting or nullifying symbolic spells.",
      "Casts all symbolic spells as 2 levels higher. Gains 1 ka defence."]},
  "technopriest": {
    "name": "Technopriest",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Sufficiently advanced magic.",
    "description": "Anointed by the ",
    "table": [
      "Archways of perception",
      "Cogwheel of eternal return",
      "Egg of the first land",
      "Glittering fast stars",
      "Ill nano of re-creation",
      "Whether weaver"
    ],
    "ranks": [
      "[+] when channelling forces beyond mortal ken. Reduces prices of imbued spells by 1 (minimum 1). Rolls spell effects with [+] in sanctified areas.",
      "Rider behind the eyes. Can focus and maintain one spell per round as a free action. Can spend 1 life and a few minutes to sanctify a small area.",
      "Conduit of the ageless. Gains 1 ha and ka defence. Can let their rider take control. While the rider is in control, hero casts all spells as though they were level 17. Hero also gains 1 burden per round. Will the rider also leave?"]},
  "thoughtfulasthothtrueseer": {
    "name": "Thoughtful as Thoth Trueseer",
    "tags": ["mutation", "ka"],
    "flavor": "With progressive insight, human constraints and fears fade away.",
    "ranks": [
      "+1 thought and maximum thought increased to 6.",
      "+1 thought, max to 7.",
      "+2 thought or hero becomes immune to enchantments and other mind-control technologies."]},
  "traitorous": {
    "name": "Traitorous",
    "tags": ["trait", "ba", "combat"],
    "flavor": "The opportune moment arrives.",
    "ranks": [
      "Deals 1d6* bonus damage with hidden weapons, surprise attacks, and attacks from hiding. Their critical hit multiplier with such attacks increases 1 step.",
      "Hero gains [+] to charming or befriending creatures. Hero gains [+] to tests against friends. Also, their traitorous bonus damage increases to 2d6*.",
      "Bonus damage increases to 3d6*. Critical threat range and hit multiplier increase 1 step."]},
  "transhumanreflexes": {
    "name": "Transhuman Reflexes",
    "tags": ["mutation", "ha", "technological"],
    "flavor": "Neural rewiring and fast-twitch nodes lifted from the dark sky supersoldier programs.",
    "ranks": [
      "Hero gains [+] on initiative tests and always gets one (more) action during any surprise round.",
      "[+] whenever hero tests to dodge or otherwise avoid incoming danger.",
      "Hero gains an additional action or mild precognition (+2 to all defences)."]},
  "treehugger": {
    "name": "Tree Hugger",
    "tags": ["trait", "ka"],
    "flavor": "Friend of herbs & fluffy creatures.",
    "description": "Hero feels at home in ",
    "table": [
      "Exotic beaches",
      "Manicured parklands",
      "Painted deserts",
      "Refreshing forests",
      "Scenic mountains",
      "Urban jungles"
    ],
    "ranks": [
      "Hero gains 1 aura and 1 ka defence. In their native environment they blend in flawlessly, gaining [+] to hiding and moving without trace. They also add their aura stat to all defences while there.",
      "Beautiful soul. Gains 1 thought. As an action, the hero can call upon a vast store of inspiring sayings to bolster all nearby allies, who gain [+] to their hero dice rolls. Alternatively, they can infuriate the same allies with their sayings, granting [+] to their physical tests.",
      "Furious spirit. Gains 1 strength. Hero gains [+] to attacks against targets who threaten their beloved natural environment or disagree with their firm beliefs in even the most minute detail."]},
  "truewarrior": {
    "name": "True Warrior",
    "tags": ["trait", "ha", "combat"],
    "flavor": "Beyond reality’s gates, only war.",
    "description": [
      "(This ability is not compatible with abilities that decrease a hero’s magic cost.)"
    ],
    "ranks": [
      "Hero’s connection with the essential nature of struggle increases their life by 2 points for each of their levels (current and future). But their magic cost is increased by 1.",
      "The hero learns a new praxa and gains 1 ha defence.",
      "Adds proficiency bonus to all physical damage and gains 1 ha defence."]},
  "truewizard": {
    "name": "True Wizard",
    "tags": ["trait", "ka", "technological"],
    "flavor": "Welcome to the universe.",
    "description": [
      "(Magic cost can never be reduced below 1. This ability is not compatible with abilities that increase a hero’s magic cost.)"
    ],
    "ranks": [
      "Hero’s magic cost is reduced by 1. But the connection with the void of wizardry reduces hero’s life by 2 points for each of their levels (current and future).",
      "The hero learns a new magic skill and gains 1 ka defence.",
      "Hero reduces all spell prices by one (minimum of 1) and gains 1 ka defence."]},
  "ultimatechimerism": {
    "name": "Ultimate Chimerism",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "No beast shall dominate another beast in the chimerical time.",

    "ranks": [
      "Feet become deformed and oddly turned. Walking is impaired.",
      "Legs change form and angle, becoming bestial. Wearing shoes becomes impossible.",
      {
        "base": "Legs and feet clearly resemble ",
        "entries": [
          "the hoofed limbs of an ungulate",
          "the paws of a predator",
          "the talon-tipped feet of a bird",
          "nothing so much as the many-jointed limbs of an endoskeletal insect"
        ],
        "end": "."
      },
      "The hero pupates, and in a grotesque transformation, their abdomen, hips, and lower limbs are duplicated. With four legs, their movement is faster or more sure, but they are less manoeuvrable. Chairs and tight spaces become uncomfortable."]},
  "unblinking": {
    "name": "Unblinking",
    "tags": ["trait", "ka", "technological"],
    "flavor": "An inhuman stare.",
    "ranks": [
      "The hero never needs to blink. [+] whenever undivided attention is useful. Harder to surprise. Also, creeps people out.",
      "[+] to casting and nullifying horrific spells as hero gazes directly into the eye of madness.",
      "Reptilian. Hero can stand completely motionless and gains [+] to tests in any round where their side has lost initiative."]},
  "uncannyconfidence": {
    "name": "Uncanny Confidence",
    "tags": ["trait", "ba", "social", "combat"],
    "flavor": "Reality bends before belief.",
    "ranks": [
      "Hero adds their pro to all social damage rolls.",
      "Hero adds their pro to their social defence.",
      "Hero gains [+] to all social damage rolls."]},
  "undyingparasiteheart": {
    "name": "Undying Parasite Heart",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Have a little piece of their heart.",
    "ranks": [
      "The hero’s heart is a ba-symbiote which stores their memory-patterns. The symbiote is a perfect auto-replicant and cannot die of old age. When the ‘heart’ is placed in a suitable excavated body cavity, it sprouts tendrils and a crystalline neural web, taking over the host in days. Every time the hero is ‘reborn’ this way, they lose a mental stat point, coming closer to their final end as a twitching madness of pulsing, tentacled flesh.",
      "The monstrous heart is larger and stronger. The hero permanently gains 1 endurance and [+] to long-distance running and other endurance sports.",
      "The monstrous heart is even stronger. The hero permanently gains 1 endurance. Every time it takes over a new host, the hero acquires one of the host’s skills. If the hero has no available skill slots left, they may use inventory slots to store additional skills in subsidiary neural organs."]},
  "upliftedexemplar": {
    "name": "Uplifted Exemplar",
    "tags": ["trait", "ha", "ka", "technological"],
    "flavor": "Now they understand.",
    "description": "The hero was a ",
    "table": [
      "Capybara",
      "Chimpanzee",
      "Pig",
      "Pigmy Rhino",
      "Mouse",
      "Tortoise",
      "Wolf",
      "Zebra"
    ],
    "ranks": [
      "Now they are a bestial humanoid one-off with super-human aptitudes and opposable thumbs. Hero gains 1 stat point and one heightened sense appropriate to their base animal. The heightened sense grants [+] in relevant situations.",
      "The uplift did not stop. It kept working, changing. Hero gains 2 thought. Their thought stat maximum is increased to 7.",
      "Hero gains 1 more thought. Maximum increased to 8. Superhuman manual dexterity and astounding brainpower give the hero [+] with improvised equipment, weapons, and world domination plots."]},
  "vacuumhardened": {
    "name": "Vacuum Hardened",
    "tags": ["trait", "ha", "technological"],
    "flavor": "When did they forget Old World?",
    "ranks": [
      "Hero can survive a full day in hard vacuum due to significant nano-magical modification. Gains 1 endurance.",
      "Survives a full month in hard vacuum. Hero can derive sustenance from radiothermal batteries or other such devices. Gains 1 endurance.",
      "Survives indefinitely in hard vacuum. Hero can synthesize life-sustaining trace minerals and compounds with their internal artazothic organ. Gains 1 aura."]},
  "vibrantsoul": {
    "name": "Vibrant Soul",
    "tags": ["trait", "ka", "combat"],
    "flavor": "The spirit is faster than the flesh.",
    "ranks": [
      "A fiery, malevolent eye. The hero can use one of their actions to make a spiritual ka attack before other creatures act, outside the initiative order.",
      "The hero gains an additional action they can use for spiritual attacks or tests.",
      "[+] to initiative tests."]},
  "voidofmemories": {
    "name": "Void of Memories",
    "tags": ["trait", "ka", "cosmic"],
    "flavor": "The spells are eating my mind!",
    "description": "This wizard’s mind is riddled with wormholes to voids where old magics are wont to hide.",
    "ranks": [
      "Hero gains memory points equal to their highest mental stat. These are used to cast memorized spells as if they were life points. Also, hero learns a void spell.",
      "Hero’s memory points from this trait are doubled.",
      "The points are doubled again (quadrupled in total)."]},
  "vomeenhancement": {
    "name": "Vome Enhancement",
    "tags": ["trait", "ha", "technological"],
    "flavor": "Now they look into you.",
    "ranks": [
      "Technomagical machines swirl in the hero’s eyes, whirring and clicking, focusing and demanding. Hero’s eyes provide low-light vision, sure, but their eyes are also ridiculously sharp and come with built-in filters. They can stare into the sun-line safely. The optics provide [+] to all long-distance aimed attacks.",
      "The hero’s optophotonics can convert the hero’s own life force into a ray attack (1d12 damage, long range, #precise, costs 1 life per attack).",
      "Hero gains 3 inventory slots. The optophotonics expand and invade other tissues. The hero gains an integrated toolkit for one skill of their choice. This toolkit takes up one slot. The hero also gains a random mutation."]},
  "wakingboneslament": {
    "name": "Waking Bones’ Lament",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "There is no life eternal but death.",
    "ranks": [
      "Hero becomes bony and raw. Skin is like parchment, digestion slows and weakens.",
      "Only sinew and gristle remain beneath paper skin. Joints click and rattle. The skeletal hero can only digest blended soups.",
      "The hero’s organs atrophy, leaving a mummified undead abomination. They can only digest raw blood purée.",
      {
        "base": "The hero’s bones absorb their flesh, leaving a sparkling skeleton that looks like ",
        "entries": ["jade", "bronze", "ebony", "porcelain"],
        "end": "They no longer eat, directly leeching nearby creatures' life force to stay alive instead "
      }
    ]
  },
  "warmind": {
    "name": "War Mind",
    "tags": ["trait", "ka", "combat"],
    "flavor": "All combat is in the spirit.",
    "ranks": [
      "Hero fights smarter, not harder. They can choose to use their aura or thought stat when making physical tests.",
      "Additionally, can add aura or thought to dice rolled during physical conflicts.",
      "Increase aura or thought by 1. May use their aura or endurance stat for ha defences."]},
  "waterdrinkersraiment": {
    "name": "Waterdrinker’s Raiment",
    "tags": ["mutation", "ha", "chimerism"],
    "flavor": "From void sea come, to void sea return.",
    "ranks": [
      "Vestigial gills and cutaneous gas bladders form on the neck and abdomen of the hero. They can hold their breath quite a bit longer than before.",
      "An array of functional gills and gas-exchange organs turns the hero into an amphibian.",
      "Webbing increases the hero’s swimming speed.",
      "Glowing biochemical factories pockmark the body and let them breathe strange gases and liquids."]},
  "weaponslave": {
    "name": "Weaponslave",
    "tags": ["trait", "ba", "combat"],
    "flavor": "It calls me its master.",
    "description": "A weapon has found the hero. The hero believes they are its slave.",
    "ranks": [
      "While the hero carries their weapon, their strength or agility increases by 2. Without it, their endurance and aura are reduced by 1 each. If the weapon is lost, it always finds its way back at the start of the next session. Further, whenever it strikes a creature, the hero regains 1 life. When it kills a target with a soul, the hero regains 1d6 life or 1 stat point.",
      "While the weaponslave bears their weapon, all their spell prices are reduced by 2 (minimum 1). Without the weapon, their magic cost is increased by 1. Further, the weapon’s healing powers are doubled, and if the hero is injured, it tempts them to use its powers.",
      "While the hero bears their weapon, all their defences are increased by 2. Without the weapon, they take double damage from all sources. Finally, the weapon’s healing effect is tripled (restoring 3 life per strike)."]},
  "wizardkiller": {
    "name": "Wizardkiller",
    "tags": ["trait", "ka", "combat"],
    "flavor": "Smash.",
    "ranks": [
      "Hero gains 1 ka defence and [+] to damage against wizards and magical creatures. Hero’s magic cost increased by 1.",
      "Hero gains 1 ka defence and [+] to hit wizards and magical creatures. Hero’s magic cost increased by 1 more.",
      "Hero gains 2 ka defence and deals double damage to wizards and magical creatures. Hero cannot cast spells."]},
  "wordslikedaggers": {
    "name": "Words Like Daggers",
    "tags": ["trait", "ba", "social"],
    "flavor": "Speak truth to break the spirit.",
    "ranks": [
      "When hero successfully socially attacks an an opponent of lower level than themselves, the opponent is out of the conflict.",
      "When the hero knocks an opponent out of the conflict, they get a free social attack against a nearby character.",
      "Pleasure in pain. Gains 1d6 life whenever their ba attack succeeds."]},
  "zooticmasterform": {
    "name": "Zootic Masterform",
    "tags": ["trait", "ka", "chimerism", "psionic"],
    "flavor": "The pet is the boss.",
    "description": "To hero appears to be a ",
    "table": ["Cat", "Rat", "Dog", "Owl", "Parrot", "Snake", "Toad", "Spider"],
    "ranks": [
      "Hero’s strength and endurance are reduced to 0, their agility and thought increase correspondingly. Their inventory is reduced by 3. Given a few hours, they can empathically enthral a human or other oversized member of the local dominant culture to care for them and serve them. Their human servant is not a mind-controlled slave, yet still generally acts in the hero’s interest. They can have one human servant at a time.",
      "Zootelepathy. The animal hero can communicate  telepathically with their enthralled servant and make them speak, like a ventriloquist with their dummy. Once per session, the hero can dominate their enthralled servant for a few minutes. After the domination, the servant falls unconscious for a few hours.",
      "Mass zootelepathy. The animal hero can simultaneously enthral a number of humans equal to their level."
    ]
  }
}
