{
    "skills":[
        {
            "name":"Agriculturist Farmer",
            "tags":["background"],
            "flavor":"An autonomous popular people’s collective ruled by an autocrat.",
            "description":"Grows beans. Wakes up early. Tills greenhouses. Works long hours. Pays onerous taxes. Understands magic legumes. Joins the levies. Avoids attention very, very well. Wields farm implements and light long arms. Also farms other valuable",
            "table":["Squashes","Breadfruit","Tart mangoes","Saucy tangerines","Giant peaches","Turnips","Hybrid oats","Uplifted monocultural rice","Mushrooms of power","Industrial grade pumpkins","Land coral","Kelp"],
            "ranks":["Critical damage.","Damage dice increased one step.","Ignores armor."],
            "info":"SEACAT p.17"
        },
        {
            "name":"Artist Aesthetic",
            "tags":["background"],
            "flavor":"The unmanifest idea is worthless.",
            "description":"Creates treasures out of aether, dreams, and labor. Paints, sculpts, draws, dances and sings. Wields a brush and chisel, sells trinkets as avant-garde art to hungry social climbers. Known for",
            "table":["Bas relief etchings", "Croquis and caricatures", "Hyperrealist plastics", "Microlithic landscape design", "Mixed media cave paintings", "Neon jungle sculptures", "Performance welding", "Surrealist canvases"],
            "ranks":["Gets ITEM (table)"],
            "info":"SEACAT p.17"
        }
    ],
    "traits":[
        {
            "name":"Aesthetic Creation",
            "tags":["biomachine"],
            "flavor":"Made in Beautiful.",
            "ranks":[
                "Hero chooses a cosmetic mutation."
            ],
            "info":"SEACAT p.17"
        },
        {
            "name":"Artiforganism",
            "tags":["biomachine"],
            "flavor":"The unborn. The made.",
            "ranks":[
                "Hero is not actually alive. They do not need to eat, breathe, drink, or sleep. They gain energy from the sun or from magical batteries.",
                "Hero can replicate themselves given a few weeks and security backups."
            ],
            "info":"SEACAT p.17"
        },
        {
            "name":"Aural Corona",
            "tags":["fantascience"],
            "flavor":"Flaring off the elemental excess.",
            "description":"Hero is surrounded by",
            "table":["Light", "Fire", "Sky", "Water", "Green", "Metal", "Radiation", "Void"],
            "ranks":["Hero crackles with an overcharged aura. They take half damage from their element.", "Hero can spend 1 life to flare their aura to an adjacent creature, either sharing their resistance or transferring all the damage they avoided.", "Hero takes minimum damage from their element."],
            "info":"SEACAT p.17"
        },
        {
            "name":"Beneficiary of Choice",
            "tags":["fortune"],
            "flavor":"Some give, they receive.",
            "description":"Hero’s mysterious sponsors say they represent the ",
            "table":[
                "Archaic Independence Front", 
                "Council Metropolitan", 
                "De Werker Aristocracie", 
                "God Factory", 
                "Nu-Vome Consortium", 
                "Solar Gateway Initiative", 
                "Wine Vampire Endowment", 
                "Zu Kompleks DeityTM"
            ],
            "ranks":[
                "Hero gains 1 charisma (maximum +6). Once per week, they can receive a mysterious package, no larger than a small coffin, containing a non-magical machine or item of their choice.", 
                "Hero gains 1 ba defence. Once per day, hero receives guidance via a deep implant. Either [+] on their next test or a true answer (the player may simply narrate something they “know”, subject to the referee’s soft veto).", 
                "When a hero would die, they instead find themselves awake and unable to move in a strange coccoon, with shadowy shapes talking about “preparing the backup”. Next thing they know, they’re back in their bed missing some memories (hero permanently loses 1 skill)."],
            "info":"SEACAT p.17"
        },
        {
            "name":"Bloodclad",
            "tags":["power"],
            "flavor":"Action hero style.",
            "ranks":[
                "When below half life, hero only takes half physical damage. They’re tougher covered in their own shiny blood!",
                "Below half life, hero can shrug off one physical attack each round."
            ],
            "info":"SEACAT p.17"
        },
        {
            "name":"Body Magic",
            "tags":["fantascience"],
            "flavor":"There is no mind but flesh.",
            "ranks":[
                "Hero can choose to use their strength or endurance stat when casting spells or making magical tests.",
                "Additionally, can add strength or endurance to dice rolled when casting spells or during ka conflicts.",
                "Increase strength or endurance by 1. May use their strength or endurance stat for ka defences."
            ],
            "info":"SEACAT p.17"
        },
        {
            "name":"Bravely Runs Away",
            "tags":["fortune"],
            "flavor":"Can’t touch this.",
            "ranks":[
                "Opponents suffer [-] when hero is retreating. Any sacrifices to avoid encounters are worth twice as much.",
                "[+] to all tests while being chased. Ally morale does not suffer when hero retreats.",
                "Cowardly reputation. [+] to surprise attacks and against fear effects. Takes half damage from social attacks."
            ],
            "info":"SEACAT p.18"
        },
        {
            "name":"Break the Weak",
            "tags":["power"],
            "flavor":"Cut them down like wheat.",
            "ranks":[
                "When hero physically strikes an opponent of lower level than themselves, the opponent is out of the fight (and probably dead).",
                "When the hero knocks an opponent out of the fight, they get a free attack against a nearby enemy."
            ],
            "info":"SEACAT p.18"
        },
        {
            "name":"Channeling Hands",
            "tags":["fantascience"],
            "flavor":"Be the conduit.",
            "description":"Hero conducts the element of ",
            "table":[
                "Light", 
                "Fire", 
                "Sky", 
                "Water", 
                "Green", 
                "Metal", 
                "Radiation", 
                "Void"
            ],
            "ranks":[
                "Hero’s bare hands can flare with the element. They can’t throw it, but they can affect matter. Also, their unarmed attacks deal elemental damage damage.", 
                "Elemental conduit grows. Unarmed elemental damage increases two steps (e.g. 1d3 to 1d6).", 
                "Conduit grows. Damage increases two more steps (e.g. 1d6 to 1d12)."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Chromatic Avatar",
            "tags":["fantascience"],
            "flavor":"There is power in this hue.",
            "description":"Hero is chosen by the colour ",
            "table":[
                "Purple", 
                "Blue", 
                "Green", 
                "Yellow", 
                "Orange", 
                "Red"
            ],
            "ranks":[
                "The hero is vividly coloured. They have [+] to tests against targets of their own hue, for the little differences are the worst differences.", 
                "They are resistant to damage from objects of their own hue and gain [+] to effects with tools of their own hue.", 
                "With one hand they can drain other hues from objects, with the other they can impart their own hue to objects. This is about as fast and effective as regular hand painting, so changing the colour of a large object will take quite a while."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Combat Monster",
            "tags":["power"],
            "flavor":"Fight alone. Fight dirty.",
            "ranks":[
                "When the hero fights alone, they have [+] to attacks and tests to trip, trick, or otherwise hinder their enemy. But they never benefit from flanking or other help in combat.",
                "When the hero fights alone, their opponents never gain [+] from flanking or surrounding them."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Critical Master",
            "tags":["power"],
            "flavor":"Knows where it hurts.",
            "ranks":[
                "Hero’s critical hit multiplier is now equal to their proficiency or x3, whichever is higher.",
                "Critical hit multiplier is now equal to level, proficiency or x4, whichever is higher (maximum x6)."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Death Hunger",
            "tags":["power"],
            "flavor":"Death awakens the blood demon.",
            "ranks":[
                "Player tracks enemies taken out by the hero in a battle scene. Each enemy taken out grants a cumulative +1 to attacks until the end of the scene.",
                "Hero also gains cumulative +1 to damage for every enemy taken out."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Devastator",
            "tags":["power"],
            "flavor":"Damage is everything.",
            "ranks":[
                "Hero’s attacks always deal extra damage equal to their proficiency or +3, whichever is higher.",
                "Extra damage is now equal to their level, proficiency or +4, whichever is higher."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Disembodied",
            "tags":["fantascience"],
            "flavor":"Has no eyes to weep.",
            "ranks":[
                "The hero is a disembodied spirit-personality (ka-ba). They are immune to physical attacks, but their direct interaction with the physical world is also limited. They cannot exert a force more substantial than a gentle breeze or a slight temperature differential by themselves. However, they can manifest in a stone-sized physical form, perhaps a potted plant or a rat. They can use this physical form to move or even 'talk' by directly vibrating its atoms. This costs 1 life per hour or so.",
                "Their direct force is as strong as a stiff breeze or a moderate temperature difference. They can manifest within a pig- sized object, perhaps a chest or a skeleton. This manifestation costs 2 life per hour or so.",
                "They can create a strong gust of wind or a sharp temperature difference. They can also manifest within a boulder-sized object, perhaps a house or dinosaur. This manifestation costs 4 life per hour or so. Note: Manifesting in a sentient form usually causes a more-or-less violent aura contest for control between the hero and the form."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Dosemaster",
            "tags":["brains"],
            "flavor":"Measured in all things.",
            "ranks":[
                "Hero knows their doses. They don’t roll dice when healing with meds and potions or when applying poisons. Instead, they treat the maximum result as the number of charges. E.g., a med that normally restores 1d8 life always restores 8 life in the dosemaster's capable hands.",
                "Hero rolls an additional matching die, increasing the charges they can nurse out of a med dose."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Echolocator",
            "tags":["biomachine"],
            "flavor":"Voices paint pictures.",
            "ranks":[
                "Hero can use echolocation. Gains 1 agility.",
                "Hero can dimly see around corners and through closed doors using echolocation and vibrations. Gains 1 agility."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Electromagic Hacker",
            "tags":["fantascience"],
            "flavor":"Talk long enough into the machine, and it will talk back.",
            "ranks":[
                "Hero can hack adjacent oldtech creatures and equipment. In combat, hacking is one action, each command is another action.",
                "[+] to hacking tests if touching target.",
                "Hero can give target one free command per turn."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Empty Shell",
            "tags":["biomachine"],
            "flavor":"No hell or heaven awaits.",
            "ranks":[
                "Hero has no soul or ka. All curse spells always fail against them. They are resistant against all mind-affecting attacks. They can never be restored to life if they die.",
                "Hero can absorb a soul leaving its dying body, gaining 1 Aura until the next session. This destroys the absorbed soul. While they have an absorbed soul, they appear normal and not like a soulless husk."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Eternal Champion",
            "tags":["fortune"],
            "flavor":"Carrying the torch of purpose beyond the gates of time and hate.",
            "description":"(This ability is not compatible withabilities that decrease a hero’smagic cost.)",
            "ranks":[
                "Hero bonds with an eternal weapon (an L3 sidekick), sometimes as its master, sometimes as its slave. They apply their proficiency to tests with their eternal weapon, even if they don’t have a relevant skill. Further, the hero’s life increases by 1 point for each of their levels (current and future). Also, they can use their eternal weapon’s life for spell-casting. But their magic cost is increased by 1.",
                "When wielding the eternal weapon, all defences are increased by their proficiency. E.g., a hero with pro +2 increases every defence from 10 to 12.",
                "When wielding the eternal weapon, all the hero’s critical hit damage multipliers are increased by their proficiency. E.g., pro +4 increases a multiplier from x2 to x6. This applies to all attacks, not just with the weapon."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Expert Sidekicks",
            "tags":["brains"],
            "flavor":"Friends are the best.",
            "ranks":[
                "A number of sidekicks equal to the hero’s proficiency can be experts. This means they add the hero’s proficiency to their sum when testing something they’re good at.",
                "The number of possible expert sidekicks increases to the hero’s level or proficiency or 4, whichever is highest."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Fleshsong Audiophile",
            "tags":["fantascience"],
            "flavor":"Codes of creation singing in the flesh of the mortal and the damned.",
            "ranks":[
                "Hero is creepily well acquainted with biology; [+] to all biological research tests. When they touch flesh, it sings and tells them what it has experienced. After a few minutes of physical contact, they can ask or answer one question about a living creature's medical history and condition.",
                "[+] to all biological tests, including biomancer spells. Flesh songs answer questions about medical histories of dead organisms."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Fluid Anatomy",
            "tags":["biomachine"],
            "flavor":"They have organs they shouldn’t have in places they shouldn’t be.",
            "ranks":[
                "Hero's insides rearrange and rebuild to keep them going despite dreadful trauma. Hero can spend 1 stat point to turn a critical hit into a normal hit.",
                "Can spend 1 stat point to regain life equal to hero’s level.",
                "Can remove 1 burden per session."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Fool's Luck",
            "tags":["fortune"],
            "flavor":"They don’t know their luck.",
            "ranks":[
                "Hero rerolls every natural 1.",
                "Hero gains [+] to tests when they have no relevant skill.",
                "Everytime they roll a natural 1, they gain a [+] to their next roll."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Friend of the Element",
            "tags":["fantascience"],
            "flavor":"Accept the love of the source.",
            "description":"Hero is beloved of ",
            "table":[
                "Light", 
                "Fire", 
                "Sky", 
                "Water", 
                "Green", 
                "Metal", 
                "Radiation", 
                "Void"
            ],
            "ranks":[
                "Hero gains [+] to all elemental attacks.", 
                "Hero now has [+] to all element-related die-rolls, including damage.", 
                "Hero always deals double damage with element."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Gastrointestinal Upgrade",
            "tags":["biomachine"],
            "flavor":"Everything should be fuel.",
            "ranks":[
                "Hero’s gut is a marvel of technomagic. They are immune to food poisoning and gain [+] vs. all other ingested toxins. Also, they can digest anything organic, from wood to bone to petroleum.",
                "Hero has a matter converter installed in their body and can derive sustenance from inorganic material."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Gifted",
            "tags":["fortune"],
            "flavor":"They have that special touch.",
            "ranks":[
                "Hero’s pro increases by 1.",
                "Increases by 1 more."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Glittering Incorruptible",
            "tags":["fortune"],
            "flavor":"The body is a temple of purity.",
            "ranks":[
                "Hero’s source code has been enhanced by chance or ancient germline intervention. The hero cannot suffer mutations through corruption. Instead, they take a point of harm. The ill hero requires a week’s rest to recover.",
                "Hero’s source code actively resists all diseases and toxins. Hero can choose to lose 1 stat point to avoid all other effects of a disease or poison.",
                "Hero can not be reduced to 0 life through social attacks. They are simply too golden."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Gravitas",
            "tags":["fortune"],
            "flavor":"The presence abides.",
            "ranks":[
                "Hero’s mere presence is an argument. They can choose to use their aura or endurance stat when making social tests.",
                "Additionally, can add aura or endurance to dice rolled during social conflicts.",
                "Increase aura or endurance by 1. May use their aura or endurance stat for ba defences."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Hacked Shorttimer",
            "tags":["power"],
            "flavor":"We were better for a while.",
            "ranks":[
                "Hero comes from stock crudely optimized for improved short term performance. They gain 1 strength, endurance, or agility. Sadly, their bio-cobbled body imposes [-] against diseases, venoms, or toxins.",
                "The optimization went further than was wise. Hero gains 1 more strength, endurance, or agility. Their physical stat maximum is increased to 6. Alas, they suffer [+] damage from one type of attack: physical, social, or mental.",
                "Flawed divinity. Hero gains 1 more strength, endurance, or agility, and 1 charisma. Their physical stat maximum is increased to 7. Hero suffers [-] against one kind of elemental assault."
            ],
            "info":"SEACAT p.39"
        },

        {
            "name":"Honour Bound",
            "tags":["fortune"],
            "flavor":"Where courts dare not tread, honour is the law.",
            "ranks":[
                "Hero possesses an aura of honour, granting [+] to social tests in nomadic and clan-based societies.",
                "Powerful mana protects the hero from dishounorable opponents (i.e. city-dwellers or hunter-gatherers). Their social attacks against the hero have [-].",
                "Tribal aura. Hero takes half damage from all social attacks in the wild lands."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Improved",
            "tags":["biomachine"],
            "flavor":"A fantascience product.",
            "ranks":[
                "Hero chooses a beneficial mutation."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Inspiring Hero",
            "tags":["brains"],
            "flavor":"For great glory!",
            "description":"The intangible quality of a leader has a quantity all of its own.",
            "ranks":[
                "A number of sidekicks equal to the hero’s proficiency fights with unmatched ferocity. They add the hero’s proficiency score to all their attacks and tests during battle scenes.",
                "The number of possible inspired sidekicks increases to the hero’s level or proficiency or 4, whichever is highest."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Insufferably Cute",
            "tags":["fortune"],
            "flavor":"Just the cutest.",
            "ranks":[
                "A winsome face. [+] to social interactions, but all interactions take twice as long as everyone fusses over the hero.",
                "Small and cuddly. [-] to all direct attacks against the hero, but the hero’s inventory is permanently reduced by 3."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Lazarus Soldier",
            "tags":["power"],
            "flavor":"Didn't let them grind ya down.",
            "ranks":[
                "The first time the hero is reduced to 0 life in a session they immediately regain 6+level life.",
                "When the hero would be permanently removed from play, the player can return them into play in the next scene. The hero gains a permanent scar or burden occupying one inventory slot and loses a rank of Lazarus Soldier.",
                "After the hero dies, they return to life on the next full moon or another significant astrological event. This creates a probabilistic dysfunction and unleashes an undead plague."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Lifewind Inhalation",
            "tags":["power"],
            "flavor":"Deep breaths, action hero, deep breaths.",
            "description":"Absorb the vital principles of sky and green through superior patterns of consciousness.",
            "ranks":[
                "Hero recovers twice as much life when spending a hero die to recover life.",
                "Thrice as much life. Additionally, spending a hero die to recover life grants one boon.",
                "Four times. Additionally, spending a hero die to recover life makes them glow bright as a torch for a few hours."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Luminous",
            "tags":["fantascience"],
            "flavor":"Let the light shine out.",
            "ranks":[
                "The hero’s insides are aglow. They can release it from their mouth or eyes with the radiance of a powerful torch.",
                "Hero gains [+] to ka attacks and magic tests in brightly illuminated spaces.",
                "They sparkle like diamonds and are resistant to physical damage in bright light."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Machine Whisperer",
            "tags":["brains"],
            "flavor":"Soothe the savage robot.",
            "ranks":[
                "Talking machines naturally like the hero. [+] to social tests with machines.",
                "Complex machines always try to help the hero. Complicated locks try to unlock themselves when whispered to, audio-visual orbs try to fix themselves when banged vigorously."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Master Blaster",
            "tags":["power"],
            "flavor":"Only Blaster leave!",
            "ranks":[
                "Hero rolls all exploding damage dice (e.g. 1d6*) with [+].",
                "[+] to all explosive tests, including attacks and spells. Hero feels the energy trapped in matter yearning to be free like a phoenix.",
                "Oops. Blaster blew up. Time for a new hero."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Memory Palace",
            "tags":["brains"],
            "flavor":"A prison of dreams traps the unwary.",
            "description":"A true wizard’s mind is a scary old palace, full of dark holes where magical parasites hide. (Players should fancifully describe their hero’s memory palace. The more fanciful, the better.)",
            "ranks":[
                "The hero squirrels away extra spell burdens in their mind as magic memories. The memory palace has a number of magic rooms equal to their level. This is a bonus inventory just for carrying spells.",
                "Hero also gains memory points equal to their level. These are used to cast memorized spells as if they were life points.",
                "Hero’s memory point total from this ability is doubled."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Meticulous Ritualist",
            "tags":["fantascience"],
            "flavor":"Accurate ritual records must be kept for meaningful summoning!",
            "ranks":[
                "Hero gains [+] to tests when casting all spells taking over a dozen minutes to cast.",
                "Hero also rolls effects of their ritual spells with [+].",
                "Hero reduces price of all ritual spells they cast by 2 (minimum of 1)."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"More Than Human",
            "tags":["fantascience"],
            "flavor":"The cosmos gazing at itself.",
            "ranks":[
                "An awareness of common consciousness grants the hero [+] to communicating with synthetics, golems, and void creatures.",
                "The hero is incredibly versatile, adapting to alien dimensions, higher colours, strange gravities, and non- euclidean spaces within a few minutes. This negates environmental penalties, though the hero may still dies from exposure, lack of air, etc.",
                "Tapping the cosmic mind, the hero gains [+] to all social and mental interactions with alien sentiences. Additionally, the hero can willingly abandon their mortal shell and become a ka-ba spirit. This is a one-way trip. Afterwards, humans count as alien sentiences for the hero."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Motorbreath",
            "tags":["brains"],
            "flavor":"Give me that which I desire.",
            "ranks":[
                "Hear the roar. [+] when using machines with engines.",
                "Eat the dust. Gains an extra action when using a machine with an engine.",
                "Break on through. [+] to damage and initiative with machines with engines. Critical range increased one step in vehicular combat."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Natural Born Comrade",
            "tags":["fortune"],
            "flavor":"Icon of the hunter scavengers.",
            "ranks":[
                "Hero gains [+] to social tests among their equals. Whenever they give away most of their wealth in social conflict and keep an equal or smaller proportion for themselves, all their attacks are twice as effective.",
                "Wealthier opponents have [-] to social and physical attacks against the hero. Hero deals double social and physical damage to wealthier opponents.",
                "Hero suffers no penalties from opulent wealth in the eyes of the poor since they are only safeguarding the wealth for the common folk."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Neural Machine Symbiote",
            "tags":["biomachine"],
            "flavor":"Silver ships slip through my veins.",
            "description":"Tiny silver animalcules flow through the hero’s bloodstream, glittering golden wires thread their neural networks.",
            "ranks":[
                "Hero can pilot golems and other thinking machines hands- free. The symbiote accelerates their mind (hero gains 1 thought).",
                "The symbiote accelerate all reflexes (hero gains 1 agility) and lets the hero talk with machines and other neurally enhanced humans at great distances."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Noblesse Obliged",
            "tags":["fortune"],
            "flavor":"Better folks are bred, not made.",
            "ranks":[
                "Hero owns a country estate and a fancy title. Social attacks can never remove the hero from play. Hero gains an additional hurt state, “attending to personal matters in the countryside.” This hurt state immediately removes the hero from play for the session. Still, it prevents further injury, as they are ensconced in their “cottage”.",
                "Lucky death of a relative brings finances to match the title. Hero gains [+] whenever money would be an issue. Because money, or at least credit, is not an issue.",
                "Friends in high places. Once per session, the hero can call on a favour to get out of a pickle or rum do. Hero gains [+] in all courts of law and public opinion."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Omniactivation",
            "tags":["fortune"],
            "flavor":"The red button will be pushed.",
            "ranks":[
                "Hero ignores all restrictions on all fantascientific devices. Doors recognize them, sentient bombs talk to them. Does the hero understand what they do? Unlikely.",
                "Once per session, the hero can touch a dead fantascientific machine or artifact and it sparks to life, giving off one last gasp of utility. A dead autowagon rolls forward a last few meters. A visual calculator’s last output glows dimly on its cathode sphere for a few minutes. An electronic lock reactivates and bolts a door."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Overlooked by the Gods",
            "tags":["fortune"],
            "flavor":"Omniscience is a lie.",
            "ranks":[
                "All holy or sacred tests rolled against the hero suffer [-].",
                "All curses and blessings have minimal effect against the hero. Hero gains 1 aura.",
                "Hero gains [+] to all attacks and direct tests against the extra- normal 'gods' and their 'divine' servitors. They just slide off those creatures' perception fields."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Panmolecular Sensorium",
            "tags":["biomachine"],
            "flavor":"Hear the songs of the oceans. Read stories in wind and stream.",
            "ranks":[
                "Hero’s sensorium is expanded with new cutaneous and olfactory organs that let them read trace molecular remains. Their sense of smell is as acute as a bloodhound’s, and they can ‘taste’ with their fingertips. [+] when tracking, testing food for poison, sampling fuel for impurities, and other similar tests.",
                "Hero can literally smell emotions. [+] to discerning intentions, picking up lies, and ferreting out tricks."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Perfectly Balanced",
            "tags":["brains"],
            "flavor":"Suspended between steps.",
            "ranks":[
                "Hero always balances on any narrow surface or tight rope. Can also perfectly balance objects.",
                "Like water, hero never loses their mental or social equilibrium. Resistant to fear, shame, regret, worry, and anxiety.",
                "Gains [+] to balance competing claims and pass legal or moral judgements."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Pheromone Panoply",
            "tags":["biomachine"],
            "flavor":"Scent worth a hundred memories.",
            "description":"Write poetry with biochemistry.",
            "ranks":[
                "The hero has modified biological chemo-factories in their body. These provide communication molecules on demand. [+] to charming or intimidating social attacks. Can scare away or ‘blind’ creatures like ants and termites that rely primarily on chemical signals for communication.",
                "Hero can use their pheromone panoply to communicate with and try to command insects or other creatures that depend on pheromones."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Polybody Unity",
            "tags":["brains"],
            "flavor":"More bodies, more choices.",
            "description":"(If a hero sends off a body on its own, the player decides how much life is assigned. The player can invest xp in a body to increase its stats and life totals. Heroes may merge with a new body instead of outright stealing their body. In this case, the player rolls a new set of mental stats and uses the set with a higher aura score. The hero gains one bonus skill and replaces a number of other skills equal to their new thought score.)",
            "ranks":[
                "Hero has an additional body. Their bodies are connected in a real-time glandular psyche-to- psyche network. Neither body has priority, and they have a single mind. The hero can have up to 3 bodies. Adding a body is very expensive. It takes about a week, and requires a surgeon- psychopomp. Each additional body is treated as a secondary character with its own physical stats and action pool. Each body beyond the first in visual range grants 5 life points. Area attacks against polybody characters multiply their damage by the number of bodies present.",
                "Hero can have up to 6 bodies. Some of their bodies can be animals.",
                "Hero can have up to 9 bodies. Some of their bodies can be synthetics."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Porcelain Skin",
            "tags":["fantascience"],
            "flavor":"They made people prettier once upon a time.",
            "ranks":[
                "Hero's uncannily smooth skin is resistant to diseases and scarring. Gains 1 charisma.",
                "Hero’s luminous skin is resistant to acid, chemicals and fire (half damage). Gains 1 more charisma."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Protector of Innocents",
            "tags":["fortune"],
            "flavor":"Despite the gore, a noble cause.",
            "ranks":[
                "Hero gains [+] to attacks and tests when fighting to protect an unarmed or helpless innocent.",
                "Once per turn hero can instantly redirect an attack from a nearby creature to themselves (this is not an action). Hero can redirect additional attacks at the cost of 1 life per attack. Word gets around. Downtrodden communities scrape together resources to help the hero.",
                "[-] to all attacks and damage against the hero while defending an innocent."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Psion Scion",
            "tags":["brains"],
            "flavor":"A soft blanket for the soul.",
            "ranks":[
                "Low-level empathic field grants [+] to trickery, lies, and illusions.",
                "[+] to direct mental attacks against a single target.",
                "Empathetic enlightenment. [+] to assist, console, and otherwise help scared and vulnerable creatures. Resistant to fear and trickery."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Qanat of Power",
            "tags":["fantascience"],
            "flavor":"Hidden channels, rushing energies.",
            "ranks":[
                "The hero casts all spells as though they were 2 level higher.",
                "When the hero casts a spell, they channel 1 life point from the void, reducing their spell price.",
                "Casts as 4 levels higher."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Querulous Kvetch",
            "tags":["power"],
            "flavor":"Complaining is a cure.",
            "ranks":[
                "Hero gains an additional hurt state, “grumbling quietly.” It imposes no penalties.",
                "Hero gains one more hurt state, “griping and groaning.” When the hero reaches this state, sneaking becomes difficult [-].",
                "Hero gains a third hurt state, “kvetching viciously.” When the hero reaches this state, they suffer [-] to social interactions. They also gain [+] to one action."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Radiant Panoptics",
            "tags":["biomachine"],
            "flavor":"The inverse of colour blindness. Redline machine microbes swirl in the hero’s eyes.",
            "ranks":[
                "Hero’s infraoptic symbiotes detect heat signatures and traces. Gains [+] to survival and investigation tests.",
                "Hero can “see” in the absence of visible light using a panoply of electromagnetic sense organs.",
                "Hero’s senses can probe through several layers of base matter. Gains [+] when searching for hidden objects or trying to figure out if somebody is standing behind the draperies."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Rauber Baron",
            "tags":["brains"],
            "flavor":"Money is magic.",
            "ranks":[
                "Hero is savvy. Hero has [+] to all business-related rolls. Including treasure rolls.",
                "Hero is surprisingly well-off. Hero can deal physical damage with social attacks. It’s called paid help. Once per session, they acquire an expensive item on “credit”.",
                "Hero reveals they have a servile butler running a monopolistic corporation on their behalf. Hero can deal mental damage with social attacks. It’s called owning a media subsidiary. Once per session, they turn out to own a useful building or asset."
            ],
            "info":"SEACAT p.39"
        },
        {
            "name":"Renowned Racer",
            "tags":["brains"],
            "flavor":"The grand velocity trophy proves life has meaning.",
            "ranks":[
                "[+] to tests during vehicular chases. Fame (and notoriety) also grant the hero [+] in many social interactions.",
                "Some of them were death races. [+] when manoeuvring to attack or defend with a vehicle.",
                "Gains an extra driving action every turn."
            ],
            "info":"SEACAT p.39"
        }
    ],
    "mutations":[
        {
            "name":"Another Mind",
            "tags":["psionic"],
            "flavor":"The seed of truth grows within.",
            "ranks":[
                {"base":"Hard, cyst-like nodule develops on the ", "entries":["throat", "stomach","lumbar spine","upper back"], "end":"."},
                "The nodule grows larger and bonier, a secondary brain begins to develop within. Reflexes are accelerated while the hero becomes vulnerable to critical hits. Clothes no longer fit.",
                "The secondary brain grows larger and faster. The hero’s perception and analytical abilities increase. The disfigurement is more pronounced.",
                {"base":"The secondary brain achieves a semblance of independent thought and develops unusual mental abilities, such as ", "entries":["pyrokinesis","telekinesis","electrokinesis","tele-empathetic manipulation"], "end":". Sometimes it takes over the hero’s body."}
            ],
            "info":"SEACAT p.70"
        },
        {
            "name":"Astral Eyes",
            "tags":["psionic"],
            "flavor":"The world you know is a veil hiding the deeper beauty of the fields of ka.",
            "ranks":[
                {"base":"Eyes turn", "entries":["milky", "pitch black","translucent","like amber orbs"], "end":". Vision is impaired."},
                "Eyes evaporate out of their sockets. Hero is blind.",
                "A heavy, misty gas leaks out of the hero’s sockets. They perceive auras with new organs growing where their eyes once rolled in fear and terror."
            ],
            "info":"SEACAT p.70"
        }
    ],
    "items":[
        {
            "name":"Flamethrower",
            "tags":["weapon","machine"],
            "flavor":"Roast em, toast em, extra well-done.",
            "description":"Held together by spit and duct tape, a deadly fire-spraying contraption.",
            "weight": 100,
            "table":"1d6d6",
            "value":"7",
            "crafting":["metal","metal","fuel","fuel"],
            "ranks":["0","1","2","3","4","5"]
        },
                {
            "name":"Wheel of Cheese",
            "tags":["food"],
            "flavor":"Extra delicious, no need to reinvent.",
            "description":"Cheese.",
            "weight": 10,
            "value":"2",
            "crafting":["biological","biological"],
            "ranks":["0","1","2","3","4","5"]
        }
    ]
}